
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="style/styleguide.css">
    <link rel="icon" href="./files/logo/icn_ar.png">
    <script defer type="module" src="./js/scriptguide.js"></script>
    <title>الإرشادات</title>
</head>
<body>
    
    <div class="wrapper">
        
        <main id="divmain" class="divmain">
            
            <div class="widget widgetGuideUp">
                
                <h1>الإرشادات</h1>
                
                <div class="content">
                    
                    هذا الموقع يقدم خدمة لمجتمع المطورين بمختلف مستوياته
                    </br>
                    يمكن المبتدئ من المشاركة في المشاريع التدريبية لتجربة العمل ضمن الفريق
                    </br>
                    ويمكن المحترفين من إنشاء فريق يضم أعضاء ضمن مجال تخصص المشروع
                    
                </div>
                
            </div>
            
            
            <div class="widget widgetGuide">
                
                <div class="part partText">
                    <ul>
                        <li>
                            بعد التسجيل والدخول ستنتقل مباشرة إلى صفحة الرئيسية
                        </li>
                        <li>
                        من خلال القائمة يمكنك إنشاء مشروع جديد عبر الخيار "جديد"
                        </li>
                        <li>
                        بعد إكتمال إنشاء المشروع سيتم نقلك مباشرة إلى صفحة إدارة المشروع
                        </li>
                        <li>
                        أو يمكنك تصفح جميع المشاريع من خلال الخيار "مشاريع" في شريط الهيدر
                        </li>
                    </ul>
                </div>
                
                <div class="part partImage">
                    <img src="./files/imgsGuide/img1.png">
                </div>
                
            </div>
            
            <div class="widget widgetGuide">
                
                <div class="part partImage">
                    <img src="./files/imgsGuide/img2.png">
                </div>

                <div class="part partText">
                    <ul>
                        <li>
                            في صفحة إدارة المشروع يمكنك إدارة المشروع والتحكم به
                        </li>
                        <li>
                            يمكن التعديل على بيانات المشروع العامة مثل الاسم ونوع المشروع وذلك من خلال زر التعديل لكل معلومة
                        </li>
                    </ul>
                    
                </div>
                
            </div>
            <div class="widget widgetGuide">

                <div class="part partText">
                    <ul>
                        <li>
                            خيار طلب الإنضمام هو للتحكم في مشروعك للظهور في المشاريع عند البحث, وإمكانية الإنضمام إليه
                        </li>
                        <li>
                            المساحة العامة هي للإنتقال إلى صفحة المساحة العامة .. سيتم شرحها لاحقاً
                        </li>
                        <li>
                            علامة + تعني إضافة مهارة جديدة إلى المشروع
                        </li>
                        <li>
                            زر التوجيهات للإنتقال إلى ويدجت التوجيهات للفريق ونشر توجيه 
                        </li>
                        <li>
                            القائمة الظاهرة هي قائمة المهارات المضافة للمشروع عند التوسع تظهر خيارات للمهارة
                            مثل التعديل والحذف وإتاحة الإنضمام للمهارة عند طلب إنضمام الأعضاء الجدد
                        </li>
                        <li>
                            علامة + في المهارة تعني إضافة مهمة جديدة لفريق المهارة
                        </li>
                    </ul>
                    
                </div>
                
                <div class="part partImage">
                    <img src="./files/imgsGuide/img3.png">
                </div>
                
            </div>
            <div class="widget widgetGuide">
                
                <div class="part partImage">
                    <img src="./files/imgsGuide/img4.png" class="down1">
                </div>

                <div class="part partText">
                    <ul>
                        <li>
                            يمكنك إستعراض طلبات الأعضاء للإنضمام للمشروع
                        </li>
                        <li>
                            يوجد عدة قوائم قائمة الطلبات الجديدة والمرشحين والمقبولين في المشروع
                        </li>
                        <li>
                            توجد 3 أزرار للتعامل مع الطلبات القبول والرفض وتجاهل الطلب
                        </li>
                        <li>
                            كما يمكنك معرفة المهارة المتقدم عليها العضو
                        </li>
                        <li>
                            علامة النجمة الظاهرة في قائمة الأعضاء المقبولين هي لتقييم الأعضاء عند إنتهاء المشروع
                        </li>
                    </ul>
                    
                </div>
                
            </div>
            
            <div class="widget widgetGuide">

                <div class="part partText">
                    <ul>
                        <li>
                            قوائم المهام لجميع المهارات  وفرزها حسب حالتها الجديدة ومنتظرة الاعتماد والمعتمدة
                        </li>
                        <li>
                            المهام الجديدة تظهر في قائمة الكل باللون الأبيض
                        </li>
                        <li>
                            بعد إستلام المهمة من احد الأعضاء تظهر باللون الرمادي
                        </li>
                        <li>
                            توجد أزرار للتعامل مع المهمة حسب حالتها للجديدة (التعديل والحذف) وللمستلمة (إظهار الملاحظة وسحب المهمة) وللمنتظرة (القبول والإعادة)
                        </li>
                        <li>
                            تنتقل المهمة إلى قائمة بالإنتظار لإعتمادها من قبل مدير المشروع
                        </li>
                        <li>
                            عندما يتم إعتمادها تنتقل إلى المكتملة
                        </li>
                        <li>
                            إذا لم تعتمد يمكنك إضافة ملاحظة للمهمة وإعادتها, وتظهر باللون الأصفر في قائمة الكل
                        </li>
                    </ul>
                    
                </div>
                
                <div class="part partImage">
                    <img src="./files/imgsGuide/img5.png" class="down1">
                </div>
                
            </div>
            
            <div class="widget widgetGuide">
                
                <div class="part partImage">
                    <img src="./files/imgsGuide/img6.png" class="down1">
                </div>

                <div class="part partText">
                    <ul>
                        <li>
                            المساحة العامة هي مكان يجتمع جميع أعضاء المشروع فيه لتبادل الاراء
                        </li>
                        <li>
                            المساحة العامة هي الصفحة الإفتراضية عند الدخول للمشروع كعضو
                        </li>
                        <li>
                            تحتوي على معلومات عامة عن المشروع
                        </li>
                        <li>
                            يمكنك الإنتقال إلى صفحة فريق المهارة الخاص بك من خلال الضغط على المهارة من قائمة المهارات
                        </li>
                        <li>
                            يوجد أيضا ويدجت يعرض التعاميم العامة التي ينشرها مدير المشروع
                        </li>
                    </ul>
                    
                </div>
                
            </div>
            
            <div class="widget widgetGuide">

                <div class="part partText">
                    <ul>
                        <li>
                            صفحة الفريق هي صفحة خاصة بأعضاء فريق المهارة الواحدة
                        </li>
                        <li>
                            في هذه الصفحة يمكن إستعراض مهام المهارة والتوجيهات الخاصة بها
                        </li>
                        <li>
                            المساحة على الطرف الأيسر هي مساحة الدردشة والتوجيهات
                        </li>
                        <li>
                            يمكنك إظهار التوجيهات بالضغط على المساحة المعتمة ويمكنك الرجوع للدردشة بالضغط على أيقونة الدردشة
                        </li>
                    </ul>
                    
                </div>
                
                <div class="part partImage">
                    <img src="./files/imgsGuide/img7.png" class="down1">
                </div>
                
            </div>
            
            
            <div class="widget widgetGuide">
                
                <div class="part partImage">
                    <img src="./files/imgsGuide/img8.png" class="down1">
                </div>

                <div class="part partText">
                    <ul>
                        <li>
                            هناك ثلاث قوائم للمهام في صفحة العضو
                        </li>
                        <li>
                            قائمة الكل وقائمة المهام التي إستلمها العضو وقائمة المهام المكتملة
                        </li>
                        <li>
                            يستطيع العضو إستلام مهمة من قائمة الكل للعمل عليها ذات اللون الأبيض أي جديدة وغير محجوزة عن طريق الزر الظاهر عند توسيع المهمة  وستنتقل إلى قائمة مهامي
                        </li>
                        <li>
                            ستظهر هذه المهمة لباقي الأعضاء باللون الرمادي علامة على إستلامها من أحد الأعضاء ولا يستطيع أحد حجزها مرة أخرى إلا بعد الخروج منها
                        </li>
                        <li>
                            بعد الإنتهاء من تنفيذ المهمة يمكن للعضو تسليمها لمراجعتها من قبل مدير المشروع لإعتمادها أو إعادتها في حال طلب تعديل عليها
                        </li>
                    </ul>
                    
                </div>
                
            </div>
            
            
            
            
        
        </main>
        
        <footer>
            <div class="containerFooter">
                
                <div class="container containerTop">
                        
                        <div class="divlogo" align="center">
                            <img id="imagelogo" class="imagelogo" src="./files/logo/logo_ar_light.png" />
                        </div>
                        
                </div>
                
                <div class="container containerRight">
                    <div class="covera">
                        <a href="https://www.tkameel.com/web/home">الرئيسية</a>
                    </div>
                    
                </div>
                
                <div class="container containerCenter">
                    <div class="covera">
                        <a href="https://www.tkameel.com/web/browseprojects">المشاريع</a>
                    </div>
                </div>
                
                <div class="container containerLeft">
                    <div class="covera">
                        <a href="https://www.tkameel.com/web/about">عن</a>
                    </div>
                    <div class="covera">
                        <a href="https://www.tkameel.com/web/guide">الإرشادات</a>
                    </div>
                </div>
                
                <div class="container containerBottom">
                    
                    <div class="footerBy">
                        
                        <label class="labelBy">أُنشئ بواسطة </label>
                        <div class="textBy">Coder | مبرمج</div>
                        
                    </div>
                        
                    <div class="footerSocial">
                        
                        <a href="">
                            <div class="footerImageX" align="center">
                                <img id="imagelogo" class="imagelogo" src="./files/logo/logo_F_White.png" />
                            </div>
                        </a>
                        
                        <a href="https://x.com/prog2023">
                            <div class="footerImageX" align="center">
                                <img id="imagelogo" class="imagelogo" src="./files/logo/logo_X_White.png" />
                            </div>
                        </a>
                    
            
                        
                    </div>
                    
                </div>
            </div>
        </footer>
        
        <div id="lightBox" class="lightBox close" onclick="clickBoxOut()">
            <div id="lightBoxCard" class="lightBoxCard" onclick="clickBox( event )">
                
            </div>
        </div>
        

    </div>
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    


    <div style="display: none;">

        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgfileimage">
                <title>icon-img</title>
                <path d="M21 3H3C1.35 3 0 4.35 0 6v12c0 1.55 1.19 2.83 2.7 2.98.1.01.2.02.3.02h18c.1 0 .2 0 .29-.02.03 0 .06-.01.09-.01C22.86 20.78 24 19.52 24 18V6c0-1.65-1.35-3-3-3zm1 13.53l-2.21-4.42c-.25-.5-.69-.87-1.22-1.03-.19-.05-.38-.08-.57-.08-.35 0-.7.09-1.01.27l-6.41 3.74-2.46-1.67C7.78 13.11 7.39 13 7 13c-.52 0-1.03.2-1.41.59L2 17.18V6c0-.55.45-1 1-1h18c.55 0 1 .45 1 1v10.53z"></path>
                <path d="m 13,10 a 2,2 0 0 1 -2,2 2,2 0 0 1 -2,-2 2,2 0 0 1 2,-2 2,2 0 0 1 2,2 z"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgdown">
                <title>icon-down</title>
                <path d="M7 10L12 15L17 10"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 20.4 20.4" id="svgmenu">
                <title>icon-remove</title>
                <path d="M19 4a1 1 0 01-1 1H2a1 1 0 010-2h16a1 1 0 011 1zm0 6a1 1 0 01-1 1H2a1 1 0 110-2h16a1 1 0 011 1zm-1 7a1 1 0 100-2H2a1 1 0 100 2h16z"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 20.4 20.4" id="svgmenu2">
                <title>icon-menu2</title>
                <path d="M 19,4 A 1,1 0 0 1 18,5 H 2 A 1,1 0 0 1 2,3 h 16 a 1,1 0 0 1 1,1 z m 0,6 a 1,1 0 0 1 -1,1 H 2 A 1,1 0 1 1 2,9 h 16 a 1,1 0 0 1 1,1 z m -1,7 a 1,1 0 1 0 0,-2 H 2 a 1,1 0 1 0 0,2 z"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgnewpermit">
            
                <path d="M13.5858,2 C14.0572667,2 14.5115877,2.16648691 14.870172,2.46691468 L15,2.58579 L19.4142,7 C19.7476222,7.33339556 19.9511481,7.77238321 19.9922598,8.23835797 L20,8.41421 L20,20 C20,21.0543909 19.18415,21.9181678 18.1492661,21.9945144 L18,22 L6,22 C4.94563773,22 4.08183483,21.18415 4.00548573,20.1492661 L4,20 L4,4 C4,2.94563773 4.81587733,2.08183483 5.85073759,2.00548573 L6,2 L13.5858,2 Z M12,4 L6,4 L6,20 L18,20 L18,10 L13.5,10 C12.6716,10 12,9.32843 12,8.5 L12,4 Z M12,11.5 C12.5523,11.5 13,11.9477 13,12.5 L13,14 L14.5,14 C15.0523,14 15.5,14.4477 15.5,15 C15.5,15.5523 15.0523,16 14.5,16 L13,16 L13,17.5 C13,18.0523 12.5523,18.5 12,18.5 C11.4477,18.5 11,18.0523 11,17.5 L11,16 L9.5,16 C8.94772,16 8.5,15.5523 8.5,15 C8.5,14.4477 8.94772,14 9.5,14 L11,14 L11,12.5 C11,11.9477 11.4477,11.5 12,11.5 Z M14,4.41421 L14,8 L17.5858,8 L14,4.41421 Z"></path> 
                
                
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 18 18" id="svgshowpermit">
                
                <path d="M1 2.25A2.25 2.25 0 013.25 0h4.793c.331 0 .65.132.884.366l3.207 3.207c.076.076.141.161.195.253a.75.75 0 01.201.144l2.104 2.103c.234.235.366.553.366.884v6.793A2.25 2.25 0 0112.75 16h-7a2.25 2.25 0 01-2.25-2.25v-.25h-.25A2.25 2.25 0 011 11.25v-9zm2.25-.75a.75.75 0 00-.75.75v9c0 .414.336.75.75.75h7a.75.75 0 00.75-.75V6H7.75A.75.75 0 017 5.25V1.5H3.25zm5.25.56V4.5h2.44L8.5 2.06zm4 9.19V6.06l1 1v6.69a.75.75 0 01-.75.75h-7a.75.75 0 01-.75-.75v-.25h5.25a2.25 2.25 0 002.25-2.25z"/>
                
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 22 22" id="svgdashboard">
                <title>icon-remove</title>
                <path d="M9.918 10.0005H7.082C6.66587 9.99708 6.26541 10.1591 5.96873 10.4509C5.67204 10.7427 5.50343 11.1404 5.5 11.5565V17.4455C5.5077 18.3117 6.21584 19.0078 7.082 19.0005H9.918C10.3341 19.004 10.7346 18.842 11.0313 18.5502C11.328 18.2584 11.4966 17.8607 11.5 17.4445V11.5565C11.4966 11.1404 11.328 10.7427 11.0313 10.4509C10.7346 10.1591 10.3341 9.99708 9.918 10.0005Z"></path>
                <path d="M9.918 4.0006H7.082C6.23326 3.97706 5.52559 4.64492 5.5 5.4936V6.5076C5.52559 7.35629 6.23326 8.02415 7.082 8.0006H9.918C10.7667 8.02415 11.4744 7.35629 11.5 6.5076V5.4936C11.4744 4.64492 10.7667 3.97706 9.918 4.0006Z"></path>
                <path d="M15.082 13.0007H17.917C18.3333 13.0044 18.734 12.8425 19.0309 12.5507C19.3278 12.2588 19.4966 11.861 19.5 11.4447V5.55666C19.4966 5.14054 19.328 4.74282 19.0313 4.45101C18.7346 4.1592 18.3341 3.9972 17.918 4.00066H15.082C14.6659 3.9972 14.2654 4.1592 13.9687 4.45101C13.672 4.74282 13.5034 5.14054 13.5 5.55666V11.4447C13.5034 11.8608 13.672 12.2585 13.9687 12.5503C14.2654 12.8421 14.6659 13.0041 15.082 13.0007Z"></path>
                <path d="M15.082 19.0006H17.917C18.7661 19.0247 19.4744 18.3567 19.5 17.5076V16.4936C19.4744 15.6449 18.7667 14.9771 17.918 15.0006H15.082C14.2333 14.9771 13.5256 15.6449 13.5 16.4936V17.5066C13.525 18.3557 14.2329 19.0241 15.082 19.0006Z"></path>
            </symbol>
        </svg>

        <svg display="none">
            <symbol viewBox="0 0 40 40" id="svgout">
                <title>icon-remove</title>
                <path d="M0 26.016q0 2.496 1.76 4.224t4.256 1.76h20q2.464 0 4.224-1.76t1.76-4.224v-20q0-2.496-1.76-4.256t-4.224-1.76h-20q-2.496 0-4.256 1.76t-1.76 4.256v4.992l4-2.496v-2.496q0-0.832 0.576-1.408t1.44-0.608h20q0.8 0 1.408 0.608t0.576 1.408v20q0 0.832-0.576 1.408t-1.408 0.576h-20q-0.832 0-1.44-0.576t-0.576-1.408v-2.496l-4-2.496v4.992zM0 16l8 6.016v-4h8v-4h-8v-4z"></path>
            </symbol>
        </svg>

        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgadd">
                <title>icon-add</title>
                <path d="M7 12L12 12M12 12L17 12M12 12V7M12 12L12 17" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>

        <svg display="none">
            <symbol viewBox="-8.5 -6 30 30" id="svgremove">
                <title>icon-remove</title>
                <path d="M11.383 13.644A1.03 1.03 0 0 1 9.928 15.1L6 11.172 2.072 15.1a1.03 1.03 0 1 1-1.455-1.456l3.928-3.928L.617 5.79a1.03 1.03 0 1 1 1.455-1.456L6 8.261l3.928-3.928a1.03 1.03 0 0 1 1.455 1.456L7.455 9.716z"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-8 -8 38 38" id="svgaddd">
                <title>icon-remove</title>
                <path d="m 11.939207,20.325731 a 1.3010526,1.3010526 0 0 1 -2.6000684,8.93e-4 V 13.309743 H 2.3222574 a 1.3010526,1.3010526 0 1 1 8.932e-4,-2.600069 H 9.3400317 L 9.3382417,3.6945792 A 1.3010526,1.3010526 0 1 1 11.938314,3.693686 l 8.93e-4,7.015988 h 7.016882 a 1.3010526,1.3010526 0 0 1 -8.94e-4,2.600069 l -7.015988,-8.93e-4 z"></path>
            </symbol>
        </svg>
        

        <svg display="none">
            <symbol viewBox="-8.5 -6 30 30" id="svgadd2">
                <title>icon-add2</title>
                <path d="m 6.926107,16.320541 c -0.05176,1.31903 -1.8157218,1.319701 -1.8683878,7.07e-4 v -5.650031 h -5.65003087 c -1.42767763,0.05603 -1.42693173,-1.9253969 7.071e-4,-1.8683875 H 5.0584263 L 5.0570163,3.1542129 C 5.0000124,1.7265792 6.9814272,1.7258332 6.9254041,3.1535058 l 7.071e-4,5.6493237 h 5.6500308 c 1.318989,0.052671 1.318318,1.8166225 -7.07e-4,1.8683875 L 6.926107,10.67051 Z"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-3 -3 30 30" id="svgadd3">
                <title>icon-add2</title>
                <path d="m 400,133.33398 a 33.333333,33.333333 0 0 0 -33.33398,33.33204 v 200 h -200 A 33.333333,33.333333 0 0 0 133.33398,400 a 33.333333,33.333333 0 0 0 33.33204,33.33398 h 200 v 200 A 33.333333,33.333333 0 0 0 400,666.66602 33.333333,33.333333 0 0 0 433.33398,633.33398 v -200 h 200 A 33.333333,33.333333 0 0 0 666.66602,400 33.333333,33.333333 0 0 0 633.33398,366.66602 h -200 v -200 A 33.333333,33.333333 0 0 0 400,133.33398 Z" transform="scale(0.03)"></path>
            </symbol>
        </svg>
        

        <svg display="none">
            <symbol viewBox="-4 -4 30 30" id="svgaccepte">
                <title>icon-accepte</title>
                <path d="M4 12L8.94975 16.9497L19.5572 6.34326" stroke-width="2.1" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="-4 -4 30 30" id="svgaccepte2">
                <title>icon-accepte2</title>
                <path d="M 651.88867 178.125 A 33.333333 33.333333 0 0 0 628.32031 187.89062 L 298.30664 517.83789 L 156.90039 376.43164 A 33.333333 33.333333 0 0 0 109.76562 376.43164 A 33.333333 33.333333 0 0 0 109.76562 423.56836 L 274.74023 588.54102 A 33.336667 33.336667 0 0 0 321.875 588.54102 L 675.45508 235.02539 A 33.333333 33.333333 0 0 0 675.45508 187.89062 A 33.333333 33.333333 0 0 0 651.88867 178.125 z " transform="scale(0.03)" stroke-width="2.1" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-2 -2 28 28" id="svgacceptedouble">
                <title>icon-acceptedouble</title>
                <path d="M4 12.9L7.14286 16.5L15 7.5" stroke="#1C274C" stroke-width="2.0" stroke-linecap="round" stroke-linejoin="round"></path>
                <path d="M20 7.5625L11.4283 16.5625L11 16" stroke="#1C274C" stroke-width="1.0" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="-2 -2 28 28" id="svgacceptedouble2">
                <title>icon-acceptedouble</title>
                <path d="m 15.494141,6.9355469 a 0.75,0.75 0 0 0 -1.058594,0.070312 L 7.1425781,15.359375 4.5644531,12.40625 a 0.75,0.75 0 0 0 -1.0585937,-0.07031 0.75,0.75 0 0 0 -0.070312,1.05664 l 3.1425781,3.601563 a 0.750075,0.750075 0 0 0 1.1289062,0 L 15.564453,7.9941406 a 0.75,0.75 0 0 0 -0.07031,-1.0585937 z" stroke-linecap="round" stroke-linejoin="round"></path>
                <path d="m 19.982422,6.8125 a 0.75,0.75 0 0 0 -0.525391,0.2324219 l -8.068359,8.4707031 a 0.75,0.75 0 0 0 -0.84375,-0.113281 0.75,0.75 0 0 0 -0.142578,1.052734 l 0.429687,0.5625 a 0.750075,0.750075 0 0 0 1.138672,0.0625 L 20.542969,8.0800781 A 0.75,0.75 0 0 0 20.517578,7.0195312 0.75,0.75 0 0 0 19.982422,6.8125 Z" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        

        <svg display="none">
            <symbol viewBox="-10 -10 45 45" id="svgignore">
                <title>icon-ignore</title>
                <path d="M23,11a1,1,0,0,0-1,1,10.034,10.034,0,1,1-2.9-7.021A.862.862,0,0,1,19,5H16a1,1,0,0,0,0,2h3a3,3,0,0,0,3-3V1a1,1,0,0,0-2,0V3.065A11.994,11.994,0,1,0,24,12,1,1,0,0,0,23,11Z
M12,6a1,1,0,0,0-1,1v5a1,1,0,0,0,.293.707l3,3a1,1,0,0,0,1.414-1.414L13,11.586V7A1,1,0,0,0,12,6Z" stroke-width="0.5"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-3 -3 30 30" id="svgignore2">
                <title>icon-ignore-2</title>
                <path d="M13 9H9M9 9V13M9 9L15 15M21 12C21 7.02944 16.9706 3 12 3C7.02944 3 3 7.02944 3 12C3 16.9706 7.02944 21 12 21C16.9706 21 21 16.9706 21 12Z" stroke-width="1.75" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="-3 -3 30 30" id="svgignore22">
                <title>icon-ignore-2</title>
                <path d="m 12,2.25 c -5.3758852,0 -9.75,4.3741148 -9.75,9.75 0,5.375922 4.3741188,9.75 9.75,9.75 5.375918,0 9.75,-4.374082 9.75,-9.75 0,-5.3758812 -4.374078,-9.75 -9.75,-9.75 z m 0,1.5 c 4.565268,0 8.25,3.6847711 8.25,8.25 0,4.565272 -3.684728,8.25 -8.25,8.25 C 7.4347711,20.25 3.75,16.565268 3.75,12 3.75,7.4347752 7.4347752,3.75 12,3.75 Z M 9,8.25 A 0.75,0.75 0 0 0 8.46875,8.46875 0.75,0.75 0 0 0 8.25,9 v 4 A 0.75,0.75 0 0 0 9,13.75 0.75,0.75 0 0 0 9.75,13 v -2.1875 l 4.71875,4.71875 a 0.75,0.75 0 0 0 1.0625,0 0.75,0.75 0 0 0 0,-1.0625 L 10.8125,9.75 H 13 A 0.75,0.75 0 0 0 13.75,9 0.75,0.75 0 0 0 13,8.25 Z"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgoutuser">
                <title>icon-svgoutuser</title>
                <!--<path fill-rule="evenodd" clip-rule="evenodd" d="M6 3C4.34315 3 3 4.34315 3 6V18C3 19.6569 4.34315 21 6 21H17C17.5523 21 18 20.5523 18 20C18 19.4477 17.5523 19 17 19H6C5.44772 19 5 18.5523 5 18V6C5 5.44772 5.44772 5 6 5H17C17.5523 5 18 4.55228 18 4C18 3.44772 17.5523 3 17 3H6ZM15.7071 7.29289C15.3166 6.90237 14.6834 6.90237 14.2929 7.29289C13.9024 7.68342 13.9024 8.31658 14.2929 8.70711L16.5858 11H8C7.44772 11 7 11.4477 7 12C7 12.5523 7.44772 13 8 13H16.5858L14.2929 15.2929C13.9024 15.6834 13.9024 16.3166 14.2929 16.7071C14.6834 17.0976 15.3166 17.0976 15.7071 16.7071L19.7071 12.7071C20.0976 12.3166 20.0976 11.6834 19.7071 11.2929L15.7071 7.29289Z" fill="#000000"></path>-->
                <path d="M6 3C4.34315 3 3 4.34315 3 6V18C3 19.6569 4.34315 21 6 21H17C17.5523 21 18 20.5523 18 20C18 19.4477 17.5523 19 17 19H6C5.44772 19 5 18.5523 5 18V6C5 5.44772 5.44772 5 6 5H17C17.5523 5 18 4.55228 18 4C18 3.44772 17.5523 3 17 3H6ZM15.7071 7.29289C15.3166 6.90237 14.6834 6.90237 14.2929 7.29289C13.9024 7.68342 13.9024 8.31658 14.2929 8.70711L16.5858 11H8C7.44772 11 7 11.4477 7 12C7 12.5523 7.44772 13 8 13H16.5858L14.2929 15.2929C13.9024 15.6834 13.9024 16.3166 14.2929 16.7071C14.6834 17.0976 15.3166 17.0976 15.7071 16.7071L19.7071 12.7071C20.0976 12.3166 20.0976 11.6834 19.7071 11.2929L15.7071 7.29289Z"></path>
            </symbol>
        </svg>
        
        
        <svg display="none">
            <symbol viewBox="-6 -6 36 36" id="svgoutuser3">
                <title>icon-svgoutuser3</title>
                
                <g id="SVGRepo_bgCarrier" stroke-width="0"/>
                
                <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"/>
                
                <g id="SVGRepo_iconCarrier"> 
                <path d="M9 20.7499H6C5.65324 20.7647 5.30697 20.7109 4.98101 20.5917C4.65505 20.4725 4.3558 20.2902 4.10038 20.0552C3.84495 19.8202 3.63837 19.5371 3.49246 19.2222C3.34654 18.9073 3.26415 18.5667 3.25 18.2199V5.77994C3.26415 5.43316 3.34654 5.09256 3.49246 4.77765C3.63837 4.46274 3.84495 4.17969 4.10038 3.9447C4.3558 3.70971 4.65505 3.52739 4.98101 3.40818C5.30697 3.28896 5.65324 3.23519 6 3.24994H9C9.19891 3.24994 9.38968 3.32896 9.53033 3.46961C9.67098 3.61027 9.75 3.80103 9.75 3.99994C9.75 4.19886 9.67098 4.38962 9.53033 4.53027C9.38968 4.67093 9.19891 4.74994 9 4.74994H6C5.70307 4.72412 5.4076 4.81359 5.17487 4.99977C4.94213 5.18596 4.78999 5.45459 4.75 5.74994V18.2199C4.78999 18.5153 4.94213 18.7839 5.17487 18.9701C5.4076 19.1563 5.70307 19.2458 6 19.2199H9C9.19891 19.2199 9.38968 19.299 9.53033 19.4396C9.67098 19.5803 9.75 19.771 9.75 19.9699C9.75 20.1689 9.67098 20.3596 9.53033 20.5003C9.38968 20.6409 9.19891 20.7199 9 20.7199V20.7499Z" transform="matrix(-0.99999999,0,0,0.99999999,20.6,0)"/> 
                <path d="M16 16.7499C15.9015 16.7504 15.8038 16.7312 15.7128 16.6934C15.6218 16.6556 15.5392 16.6 15.47 16.5299C15.3296 16.3893 15.2507 16.1987 15.2507 15.9999C15.2507 15.8012 15.3296 15.6105 15.47 15.4699L18.94 11.9999L15.47 8.52991C15.3963 8.46125 15.3372 8.37845 15.2962 8.28645C15.2552 8.19445 15.2332 8.09513 15.2314 7.99443C15.2296 7.89373 15.2482 7.7937 15.2859 7.70031C15.3236 7.60692 15.3797 7.52209 15.451 7.45087C15.5222 7.37965 15.607 7.32351 15.7004 7.28579C15.7938 7.24807 15.8938 7.22954 15.9945 7.23132C16.0952 7.23309 16.1945 7.25514 16.2865 7.29613C16.3785 7.33712 16.4613 7.39622 16.53 7.46991L20.53 11.4699C20.6705 11.6105 20.7493 11.8012 20.7493 11.9999C20.7493 12.1987 20.6705 12.3893 20.53 12.5299L16.53 16.5299C16.4608 16.6 16.3782 16.6556 16.2872 16.6934C16.1962 16.7312 16.0985 16.7504 16 16.7499Z" transform="matrix(-0.99999999,0,0,0.99999999,20.6,0)"/> 
                <path d="M20 12.75H9C8.80109 12.75 8.61032 12.671 8.46967 12.5303C8.32902 12.3897 8.25 12.1989 8.25 12C8.25 11.8011 8.32902 11.6103 8.46967 11.4697C8.61032 11.329 8.80109 11.25 9 11.25H20C20.1989 11.25 20.3897 11.329 20.5303 11.4697C20.671 11.6103 20.75 11.8011 20.75 12C20.75 12.1989 20.671 12.3897 20.5303 12.5303C20.3897 12.671 20.1989 12.75 20 12.75Z" transform="matrix(-0.99999999,0,0,0.99999999,20.6,0)"/> 
                </g>
            </symbol>
        </svg>
        
        
        <svg display="none">
            <symbol viewBox="-6 -6 36 36" id="svgoutuser33">
                <title>icon-svgoutuser33</title>
                
                <g id="SVGRepo_iconCarrier" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" transform="matrix(-1,0,0,1,20.6,0)"> 
                <path d="m 15,4 h 3 c 1.1046,0 2,0.89543 2,2 v 12 c 0,1.1046 -0.8954,2 -2,2 h -3" transform="matrix(-0.99999999,0,0,0.99999999,20.6,0)"/> 
                <path d="m 6.5,7.94 -4,4 m 0,0 4,4 m -4,-4 h 12" transform="matrix(-0.99999999,0,0,0.99999999,20.6,0)" /> 
                </g>
                
            </symbol>
        </svg>
        
        
        
        <svg display="none">
            <symbol viewBox="-6 -6 36 36" id="svgoutuser4" stroke-width="0.5">
                <title>icon-svgoutuser4</title>
                                
                <g id="SVGRepo_bgCarrier" stroke-width="0"/>
                
                <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"/>
                
                <g id="SVGRepo_iconCarrier"> <path d="M9 20.7499H6C5.65324 20.7647 5.30697 20.7109 4.98101 20.5917C4.65505 20.4725 4.3558 20.2902 4.10038 20.0552C3.84495 19.8202 3.63837 19.5371 3.49246 19.2222C3.34654 18.9073 3.26415 18.5667 3.25 18.2199V5.77994C3.26415 5.43316 3.34654 5.09256 3.49246 4.77765C3.63837 4.46274 3.84495 4.17969 4.10038 3.9447C4.3558 3.70971 4.65505 3.52739 4.98101 3.40818C5.30697 3.28896 5.65324 3.23519 6 3.24994H9C9.19891 3.24994 9.38968 3.32896 9.53033 3.46961C9.67098 3.61027 9.75 3.80103 9.75 3.99994C9.75 4.19886 9.67098 4.38962 9.53033 4.53027C9.38968 4.67093 9.19891 4.74994 9 4.74994H6C5.70307 4.72412 5.4076 4.81359 5.17487 4.99977C4.94213 5.18596 4.78999 5.45459 4.75 5.74994V18.2199C4.78999 18.5153 4.94213 18.7839 5.17487 18.9701C5.4076 19.1563 5.70307 19.2458 6 19.2199H9C9.19891 19.2199 9.38968 19.299 9.53033 19.4396C9.67098 19.5803 9.75 19.771 9.75 19.9699C9.75 20.1689 9.67098 20.3596 9.53033 20.5003C9.38968 20.6409 9.19891 20.7199 9 20.7199V20.7499Z"/> <path d="M16 16.7499C15.9015 16.7504 15.8038 16.7312 15.7128 16.6934C15.6218 16.6556 15.5392 16.6 15.47 16.5299C15.3296 16.3893 15.2507 16.1987 15.2507 15.9999C15.2507 15.8012 15.3296 15.6105 15.47 15.4699L18.94 11.9999L15.47 8.52991C15.3963 8.46125 15.3372 8.37845 15.2962 8.28645C15.2552 8.19445 15.2332 8.09513 15.2314 7.99443C15.2296 7.89373 15.2482 7.7937 15.2859 7.70031C15.3236 7.60692 15.3797 7.52209 15.451 7.45087C15.5222 7.37965 15.607 7.32351 15.7004 7.28579C15.7938 7.24807 15.8938 7.22954 15.9945 7.23132C16.0952 7.23309 16.1945 7.25514 16.2865 7.29613C16.3785 7.33712 16.4613 7.39622 16.53 7.46991L20.53 11.4699C20.6705 11.6105 20.7493 11.8012 20.7493 11.9999C20.7493 12.1987 20.6705 12.3893 20.53 12.5299L16.53 16.5299C16.4608 16.6 16.3782 16.6556 16.2872 16.6934C16.1962 16.7312 16.0985 16.7504 16 16.7499Z"/> <path d="M20 12.75H9C8.80109 12.75 8.61032 12.671 8.46967 12.5303C8.32902 12.3897 8.25 12.1989 8.25 12C8.25 11.8011 8.32902 11.6103 8.46967 11.4697C8.61032 11.329 8.80109 11.25 9 11.25H20C20.1989 11.25 20.3897 11.329 20.5303 11.4697C20.671 11.6103 20.75 11.8011 20.75 12C20.75 12.1989 20.671 12.3897 20.5303 12.5303C20.3897 12.671 20.1989 12.75 20 12.75Z"/> </g>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-6 -6 36 36" id="svgoutuser5" stroke-width="0.5">
                <title>icon-svgoutuser5</title>
                
                <path d="M14 4L18 4C19.1046 4 20 4.89543 20 6V18C20 19.1046 19.1046 20 18 20H14M3 12L15 12M3 12L7 8M3 12L7 16" stroke="#000000" stroke-width="1.2" stroke-linecap="round" stroke-linejoin="round"/>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-5 -5 34 34" id="svginuser4" stroke-width="2.5">
                <title>icon-svgoutuser4</title>
                
                <path d="M15 4H18C19.1046 4 20 4.89543 20 6L20 18C20 19.1046 19.1046 20 18 20H15M11 16L15 12M15 12L11 8M15 12H3" stroke="#000000" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
            </symbol>
        </svg>
        

        

        <svg display="none">
            <symbol viewBox="-14 -14 80 80" id="svgreturn">
                <title>icon-return</title>
                <!--<path d="M13 9H9M9 9V13M9 9L15 15M21 12C21 7.02944 16.9706 3 12 3C7.02944 3 3 7.02944 3 12C3 16.9706 7.02944 21 12 21C16.9706 21 21 16.9706 21 12Z" stroke-width="1.75" stroke-linecap="round" stroke-linejoin="round"></path>-->
                
                <path d="M12.9998 8L6 14L12.9998 21" stroke="#000000" stroke-width="4.5" stroke-linecap="round" stroke-linejoin="round"/>
                <path d="M6 14H28.9938C35.8768 14 41.7221 19.6204 41.9904 26.5C42.2739 33.7696 36.2671 40 28.9938 40H11.9984" stroke="#000000" stroke-width="4.5" stroke-linecap="round" stroke-linejoin="round"/>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="-16 -16 80 80" id="svgreturn2">
                <title>icon-return</title>
                <path d="m 36.302242,6.4824219 6.998047,6.0000001 a -2.0002,2.0002 0 0 1 0.113282,2.931641 l -7.000001,6.999999 a -2,2 0 0 1 -2.828125,0 -2,2 0 0 1 0,-2.828125 l 5.47461,-5.474609 -5.361328,-4.5937499 A -2,2 0 0 1 33.48193,6.6992187 -2,2 0 0 1 36.302242,6.4824219 Z"/>
                <path d="m 41.999508,12 a -2,2 0 0 1 2,2 -2,2 0 0 1 -2,2 H 19.005367 C 13.211123,16 8.2331921,20.786442 8.0073211,26.578125 7.7684221,32.704044 12.874224,38 19.005367,38 h 16.996094 a -2,2 0 0 1 2,2 -2,2 0 0 1 -2,2 H 19.005367 C 10.589926,42 3.6831261,34.835141 4.0112271,26.421875 4.3219541,18.454371 11.033625,12 19.005367,12 Z"/>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-8 -8 40 40" id="svgexclamation">
                <title>icon-trash</title>
                <line class="cls-1" x1="12" y1="5.3" x2="12" y2="11.98"/>
                <path d="M18.68,1.48H5.32A3.82,3.82,0,0,0,1.5,5.3v9.54a3.82,3.82,0,0,0,3.82,3.82H9.14L12,21.52l2.86-2.86h3.82a3.82,3.82,0,0,0,3.82-3.82V5.3A3.82,3.82,0,0,0,18.68,1.48Z" stroke-width="2.2" stroke-linecap="round" stroke-linejoin="round"></path>
                <line class="cls-1" x1="11.05" y1="13.89" x2="12.95" y2="13.89"/>
            </symbol>
        </svg>

        <svg display="none">
            <symbol viewBox="-8 -8 40 40" id="svgexclamation2">
                <title>icon-trash</title>
                <path d="m 11.099609,5.3007812 v 6.6796878 h 1.800782 V 5.3007812 Z"></path>
                <path d="m 5.3203125,0.58007812 c -2.5961212,0 -4.72070312,2.12458188 -4.72070313,4.72070308 v 9.5390628 c 10e-9,2.596121 2.12458193,4.720703 4.72070313,4.720703 H 8.7675781 L 12,22.792969 15.232422,19.560547 h 3.447265 c 2.596122,0 4.720704,-2.124582 4.720704,-4.720703 V 5.3007812 c 0,-2.5961212 -2.124582,-4.72070307 -4.720704,-4.72070308 z m 0,1.80078128 H 18.679687 c 1.623331,0 2.919922,1.2965918 2.919922,2.9199218 v 9.5390628 c 0,1.62333 -1.296591,2.919922 -2.919922,2.919922 H 14.486328 L 12,20.246094 9.5136719,17.759766 H 5.3203125 c -1.62333,0 -2.9199219,-1.296592 -2.9199219,-2.919922 V 5.3007812 c 0,-1.62333 1.2965919,-2.9199218 2.9199219,-2.9199218 z"></path>
                <path d="m 11.050781,12.990234 v 1.798829 h 1.898438 v -1.798829 z"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgsend">
                <title>icon-send</title>
                <path d="M19.1168 12.1484C19.474 12.3581 19.9336 12.2384 20.1432 11.8811C20.3528 11.5238 20.2331 11.0643 19.8758 10.8547L19.1168 12.1484ZM6.94331 4.13656L6.55624 4.77902L6.56378 4.78344L6.94331 4.13656ZM5.92408 4.1598L5.50816 3.5357L5.50816 3.5357L5.92408 4.1598ZM5.51031 5.09156L4.76841 5.20151C4.77575 5.25101 4.78802 5.29965 4.80505 5.34671L5.51031 5.09156ZM7.12405 11.7567C7.26496 12.1462 7.69495 12.3477 8.08446 12.2068C8.47397 12.0659 8.67549 11.6359 8.53458 11.2464L7.12405 11.7567ZM19.8758 12.1484C20.2331 11.9388 20.3528 11.4793 20.1432 11.122C19.9336 10.7648 19.474 10.6451 19.1168 10.8547L19.8758 12.1484ZM6.94331 18.8666L6.56375 18.2196L6.55627 18.2241L6.94331 18.8666ZM5.92408 18.8433L5.50815 19.4674H5.50815L5.92408 18.8433ZM5.51031 17.9116L4.80505 17.6564C4.78802 17.7035 4.77575 17.7521 4.76841 17.8016L5.51031 17.9116ZM8.53458 11.7567C8.67549 11.3672 8.47397 10.9372 8.08446 10.7963C7.69495 10.6554 7.26496 10.8569 7.12405 11.2464L8.53458 11.7567ZM19.4963 12.2516C19.9105 12.2516 20.2463 11.9158 20.2463 11.5016C20.2463 11.0873 19.9105 10.7516 19.4963 10.7516V12.2516ZM7.82931 10.7516C7.4151 10.7516 7.07931 11.0873 7.07931 11.5016C7.07931 11.9158 7.4151 12.2516 7.82931 12.2516V10.7516ZM19.8758 10.8547L7.32284 3.48968L6.56378 4.78344L19.1168 12.1484L19.8758 10.8547ZM7.33035 3.49414C6.76609 3.15419 6.05633 3.17038 5.50816 3.5357L6.34 4.78391C6.40506 4.74055 6.4893 4.73863 6.55627 4.77898L7.33035 3.49414ZM5.50816 3.5357C4.95998 3.90102 4.67184 4.54987 4.76841 5.20151L6.25221 4.98161C6.24075 4.90427 6.27494 4.82727 6.34 4.78391L5.50816 3.5357ZM4.80505 5.34671L7.12405 11.7567L8.53458 11.2464L6.21558 4.83641L4.80505 5.34671ZM19.1168 10.8547L6.56378 18.2197L7.32284 19.5134L19.8758 12.1484L19.1168 10.8547ZM6.55627 18.2241C6.4893 18.2645 6.40506 18.2626 6.34 18.2192L5.50815 19.4674C6.05633 19.8327 6.76609 19.8489 7.33035 19.509L6.55627 18.2241ZM6.34 18.2192C6.27494 18.1759 6.24075 18.0988 6.25221 18.0215L4.76841 17.8016C4.67184 18.4532 4.95998 19.1021 5.50815 19.4674L6.34 18.2192ZM6.21558 18.1667L8.53458 11.7567L7.12405 11.2464L4.80505 17.6564L6.21558 18.1667ZM19.4963 10.7516H7.82931V12.2516H19.4963V10.7516Z" stroke="#000000" stroke-width="0.0" stroke-linecap="round" stroke-linejoin="round"/>
            </symbol>
        </svg>
    
        <svg display="none">
            <symbol viewBox="0 0 1024 1024" id="svgchat">
                <title>icon-chat</title>
                <path d="M160 826.88 273.536 736H800a64 64 0 0 0 64-64V256a64 64 0 0 0-64-64H224a64 64 0 0 0-64 64v570.88zM296 800 147.968 918.4A32 32 0 0 1 96 893.44V256a128 128 0 0 1 128-128h576a128 128 0 0 1 128 128v416a128 128 0 0 1-128 128H296z" stroke="#000000" stroke-width="0.0" stroke-linecap="round" stroke-linejoin="round"/>
                <path d="M352 512h320q32 0 32 32t-32 32H352q-32 0-32-32t32-32zm0-192h320q32 0 32 32t-32 32H352q-32 0-32-32t32-32z" stroke="#000000" stroke-width="0.0" stroke-linecap="round" stroke-linejoin="round"/>
            </symbol>
        </svg>
    
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgnotification" fill="none">
                <title>icon-notification</title>
                <path d="M6.31317 12.463C6.20006 9.29213 8.60976 6.6252 11.701 6.5C14.7923 6.6252 17.202 9.29213 17.0889 12.463C17.0889 13.78 18.4841 15.063 18.525 16.383C18.525 16.4017 18.525 16.4203 18.525 16.439C18.5552 17.2847 17.9124 17.9959 17.0879 18.029H13.9757C13.9786 18.677 13.7404 19.3018 13.3098 19.776C12.8957 20.2372 12.3123 20.4996 11.701 20.4996C11.0897 20.4996 10.5064 20.2372 10.0923 19.776C9.66161 19.3018 9.42346 18.677 9.42635 18.029H6.31317C5.48869 17.9959 4.84583 17.2847 4.87602 16.439C4.87602 16.4203 4.87602 16.4017 4.87602 16.383C4.91795 15.067 6.31317 13.781 6.31317 12.463Z" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round"></path>
                <path d="M9.42633 17.279C9.01212 17.279 8.67633 17.6148 8.67633 18.029C8.67633 18.4432 9.01212 18.779 9.42633 18.779V17.279ZM13.9757 18.779C14.3899 18.779 14.7257 18.4432 14.7257 18.029C14.7257 17.6148 14.3899 17.279 13.9757 17.279V18.779ZM12.676 5.25C13.0902 5.25 13.426 4.91421 13.426 4.5C13.426 4.08579 13.0902 3.75 12.676 3.75V5.25ZM10.726 3.75C10.3118 3.75 9.97601 4.08579 9.97601 4.5C9.97601 4.91421 10.3118 5.25 10.726 5.25V3.75ZM9.42633 18.779H13.9757V17.279H9.42633V18.779ZM12.676 3.75H10.726V5.25H12.676V3.75Z" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgnotification2">
                <title>icon-notification2</title>
                <path d="M 11.669922,5.75 C 8.1641229,5.8919903 5.4372807,8.9251449 5.5644531,12.490234 L 5.5625,12.462891 c 0,0.394352 -0.2588058,0.953613 -0.6113281,1.601562 -0.3525224,0.647949 -0.7950694,1.380049 -0.8242188,2.294922 a 0.750075,0.750075 0 0 0 0,0.02344 v 0.0293 c -0.044267,1.240031 0.9171234,2.317441 2.15625,2.367188 a 0.750075,0.750075 0 0 0 0.029297,0 h 2.6523438 c 0.1309413,0.529339 0.1995594,1.089188 0.5703125,1.498047 C 10.088686,20.893832 10.875248,21.25 11.701172,21.25 c 0.824996,0 1.61059,-0.355448 2.164062,-0.970703 0.371591,-0.409216 0.441117,-0.969835 0.572266,-1.5 h 2.650391 a 0.750075,0.750075 0 0 0 0.0293,0 c 1.239139,-0.04975 2.202484,-1.127188 2.158204,-2.367188 v -0.0293 a 0.750075,0.750075 0 0 0 0,-0.02344 C 19.246998,15.443032 18.803692,14.710317 18.451172,14.0625 18.098651,13.414683 17.839844,12.856546 17.839844,12.462891 l -0.002,0.02734 C 17.965052,8.925146 15.23632,5.8919896 11.730469,5.75 a 0.750075,0.750075 0 0 0 -0.06055,0 z m 0.03125,1.5078125 c 2.660677,0.1261568 4.737297,2.4126754 4.638672,5.1777345 a 0.750075,0.750075 0 0 0 0,0.02734 c 0,0.923343 0.437665,1.665427 0.792968,2.318359 0.355304,0.652932 0.630071,1.221344 0.642579,1.625 v 0.0332 a 0.750075,0.750075 0 0 0 0,0.02539 c 0.01612,0.451398 -0.306937,0.797999 -0.716797,0.814453 h -3.082031 a 0.750075,0.750075 0 0 0 -0.75,0.753906 c 0.0021,0.462051 -0.16993,0.904903 -0.472657,1.238281 a 0.750075,0.750075 0 0 0 -0.002,0.0039 C 12.477324,19.581257 12.097847,19.75 11.701172,19.75 c -0.396675,0 -0.776112,-0.168699 -1.050781,-0.474609 a 0.750075,0.750075 0 0 0 -0.002,-0.0039 C 10.345677,18.938138 10.17372,18.4953 10.175781,18.033203 A 0.750075,0.750075 0 0 0 9.4257813,17.279297 H 6.34375 C 5.9339183,17.262844 5.608887,16.916211 5.625,16.464844 a 0.750075,0.750075 0 0 0 0.00195,-0.02539 v -0.03906 C 5.6415307,15.999494 5.9152161,15.432494 6.2695312,14.78125 6.6251007,14.1277 7.0625,13.386537 7.0625,12.462891 a 0.750075,0.750075 0 0 0 0,-0.02734 C 6.963842,9.669818 9.0396304,7.3829466 11.701172,7.2578125 Z"></path>
                <path d="M9.42633 17.279C9.01212 17.279 8.67633 17.6148 8.67633 18.029C8.67633 18.4432 9.01212 18.779 9.42633 18.779V17.279ZM13.9757 18.779C14.3899 18.779 14.7257 18.4432 14.7257 18.029C14.7257 17.6148 14.3899 17.279 13.9757 17.279V18.779ZM12.676 5.25C13.0902 5.25 13.426 4.91421 13.426 4.5C13.426 4.08579 13.0902 3.75 12.676 3.75V5.25ZM10.726 3.75C10.3118 3.75 9.97601 4.08579 9.97601 4.5C9.97601 4.91421 10.3118 5.25 10.726 5.25V3.75ZM9.42633 18.779H13.9757V17.279H9.42633V18.779ZM12.676 3.75H10.726V5.25H12.676V3.75Z"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgnotification2on2">
                <title>icon-notification2</title>
                <path d="M 11.669922,5.75 C 8.1641229,5.8919903 5.4372807,8.9251449 5.5644531,12.490234 L 5.5625,12.462891 c 0,0.394352 -0.2588058,0.953613 -0.6113281,1.601562 -0.3525224,0.647949 -0.7950694,1.380049 -0.8242188,2.294922 a 0.750075,0.750075 0 0 0 0,0.02344 v 0.0293 c -0.044267,1.240031 0.9171234,2.317441 2.15625,2.367188 a 0.750075,0.750075 0 0 0 0.029297,0 h 2.6523438 c 0.1309413,0.529339 0.1995594,1.089188 0.5703125,1.498047 C 10.088686,20.893832 10.875248,21.25 11.701172,21.25 c 0.824996,0 1.61059,-0.355448 2.164062,-0.970703 0.371591,-0.409216 0.441117,-0.969835 0.572266,-1.5 h 2.650391 a 0.750075,0.750075 0 0 0 0.0293,0 c 1.239139,-0.04975 2.202484,-1.127188 2.158204,-2.367188 v -0.0293 a 0.750075,0.750075 0 0 0 0,-0.02344 C 19.246998,15.443032 18.803692,14.710317 18.451172,14.0625 18.098651,13.414683 17.839844,12.856546 17.839844,12.462891 l -0.002,0.02734 C 17.965052,8.925146 15.23632,5.8919896 11.730469,5.75 a 0.750075,0.750075 0 0 0 -0.06055,0 z m 0.03125,1.5078125 c 2.660677,0.1261568 4.737297,2.4126754 4.638672,5.1777345 a 0.750075,0.750075 0 0 0 0,0.02734 c 0,0.923343 0.437665,1.665427 0.792968,2.318359 0.355304,0.652932 0.630071,1.221344 0.642579,1.625 v 0.0332 a 0.750075,0.750075 0 0 0 0,0.02539 c 0.01612,0.451398 -0.306937,0.797999 -0.716797,0.814453 h -3.082031 a 0.750075,0.750075 0 0 0 -0.75,0.753906 c 0.0021,0.462051 -0.16993,0.904903 -0.472657,1.238281 a 0.750075,0.750075 0 0 0 -0.002,0.0039 C 12.477324,19.581257 12.097847,19.75 11.701172,19.75 c -0.396675,0 -0.776112,-0.168699 -1.050781,-0.474609 a 0.750075,0.750075 0 0 0 -0.002,-0.0039 C 10.345677,18.938138 10.17372,18.4953 10.175781,18.033203 A 0.750075,0.750075 0 0 0 9.4257813,17.279297 H 6.34375 C 5.9339183,17.262844 5.608887,16.916211 5.625,16.464844 a 0.750075,0.750075 0 0 0 0.00195,-0.02539 v -0.03906 C 5.6415307,15.999494 5.9152161,15.432494 6.2695312,14.78125 6.6251007,14.1277 7.0625,13.386537 7.0625,12.462891 a 0.750075,0.750075 0 0 0 0,-0.02734 C 6.963842,9.669818 9.0396304,7.3829466 11.701172,7.2578125 Z"></path>
                <path d="M9.42633 17.279C9.01212 17.279 8.67633 17.6148 8.67633 18.029C8.67633 18.4432 9.01212 18.779 9.42633 18.779V17.279ZM13.9757 18.779C14.3899 18.779 14.7257 18.4432 14.7257 18.029C14.7257 17.6148 14.3899 17.279 13.9757 17.279V18.779ZM12.676 5.25C13.0902 5.25 13.426 4.91421 13.426 4.5C13.426 4.08579 13.0902 3.75 12.676 3.75V5.25ZM10.726 3.75C10.3118 3.75 9.97601 4.08579 9.97601 4.5C9.97601 4.91421 10.3118 5.25 10.726 5.25V3.75ZM9.42633 18.779H13.9757V17.279H9.42633V18.779ZM12.676 3.75H10.726V5.25H12.676V3.75Z"></path>
                <path d="M12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22Z" fill="#ff0000" transform="translate(2,2), scale(0.4)"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 60 60" id="svgnotificationOn">
                <title>icon-notification</title>
                <!--<circle cx="11" cy="8" r="5" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round"></circle>-->
                <path d="M12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22Z"></path>
            </symbol>
        </svg>
        
        
        <!-- from browse project  -->
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svglike">
                <title>icon-remove</title>
                <path d="M6 10C8.28283 8.32595 11.3995 5.54014 13.8271 1.64258C14.1784 1.07865 14.9676 0.967672 15.4374 1.43746L16.0265 2.02648C16.313 2.31302 16.3983 2.74415 16.2424 3.1182L14 8.50003H21.1257C22.3661 8.50003 23.3073 9.61747 23.0966 10.8398L21.2862 21.3398C21.1208 22.2991 20.2888 23 19.3153 23H10L6 20.5" stroke="#767676" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
                <path d="M6 8H1V22H6V8Z" stroke="#767676" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgshare">
                <title>icon-remove</title>
                <path d="M10.52 4.13998C11.25 4.35998 11.72 5.96 11.9 7.91C17.21 7.91 22 13.4802 22 20.0802C19.8 14.0802 15 12.45 11.86 12.45C11.65 14.21 11.2 15.6202 10.52 15.8202C8.41996 16.4302 2 12.4401 2 9.98006C2 7.52006 8.40996 3.52998 10.52 4.13998Z" stroke="#000000" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgcomment">
                <title>icon-remove</title>
                <path d="M12 21C16.9706 21 21 16.9706 21 12C21 7.02944 16.9706 3 12 3C7.02944 3 3 7.02944 3 12C3 13.4876 3.36093 14.891 4 16.1272L3 21L7.8728 20C9.10904 20.6391 10.5124 21 12 21Z" fill="none" stroke="#292929" stroke-width="1.5" stroke-linecap="round"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-12 -12 48 48" id="svgpostcomment">
                <title>icon-remove</title>
                <path d="M12 21C16.9706 21 21 16.9706 21 12C21 7.02944 16.9706 3 12 3C7.02944 3 3 7.02944 3 12C3 13.4876 3.36093 14.891 4 16.1272L3 21L7.8728 20C9.10904 20.6391 10.5124 21 12 21Z" fill="none" stroke="#292929" stroke-width="2.4" stroke-linecap="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="-12 -12 48 48" id="svgpostretweet">
                <title>icon-retweet</title>
                <g id="SVGRepo_bgCarrier" stroke-width="0"/>
                
                <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round" stroke-width="0.144"/>
                
                <g id="SVGRepo_iconCarrier">
                
                <path id="primary" d="M14,6H4A1,1,0,0,0,3,7V17a1,1,0,0,0,1,1H6" style="fill: none; stroke-linecap: round; stroke-linejoin: round; stroke-width:2.4;"/>
                
                <path id="primary-2" data-name="primary" d="M10,18H20a1,1,0,0,0,1-1V7a1,1,0,0,0-1-1H18" style="fill: none; stroke-linecap: round; stroke-linejoin: round; stroke-width:2.4;"/>
                
                <polyline id="primary-3" data-name="primary" points="12 4 14 6 12 8" style="fill: none; stroke-linecap: round; stroke-linejoin: round; stroke-width:2.4;"/>
                
                <polyline id="primary-4" data-name="primary" points="12 20 10 18 12 16" style="fill: none; stroke-linecap: round; stroke-linejoin: round; stroke-width:2.4;"/>
                
                </g>
                
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 18 18" id="svgshowpermit">
                
                <path d="M1 2.25A2.25 2.25 0 013.25 0h4.793c.331 0 .65.132.884.366l3.207 3.207c.076.076.141.161.195.253a.75.75 0 01.201.144l2.104 2.103c.234.235.366.553.366.884v6.793A2.25 2.25 0 0112.75 16h-7a2.25 2.25 0 01-2.25-2.25v-.25h-.25A2.25 2.25 0 011 11.25v-9zm2.25-.75a.75.75 0 00-.75.75v9c0 .414.336.75.75.75h7a.75.75 0 00.75-.75V6H7.75A.75.75 0 017 5.25V1.5H3.25zm5.25.56V4.5h2.44L8.5 2.06zm4 9.19V6.06l1 1v6.69a.75.75 0 01-.75.75h-7a.75.75 0 01-.75-.75v-.25h5.25a2.25 2.25 0 002.25-2.25z"/>
                
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-8 -8 40 40" id="svgviews">
                <title>icon-views</title>
                <path d="M12,21c-5,0-8.8-2.8-11.8-8.5L0,12l0.2-0.5C3.2,5.8,7,3,12,3s8.8,2.8,11.8,8.5L24,12l-0.2,0.5C20.8,18.2,17,21,12,21z
                M2.3,12c2.5,4.7,5.7,7,9.7,7s7.2-2.3,9.7-7C19.2,7.3,16,5,12,5S4.8,7.3,2.3,12z"></path>
                <path d="M12,17c-2.8,0-5-2.2-5-5s2.2-5,5-5s5,2.2,5,5S14.8,17,12,17z M12,9c-1.7,0-3,1.3-3,3s1.3,3,3,3s3-1.3,3-3S13.7,9,12,9z"></path>
            </symbol>
        </svg>
        
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgmoving">
                <title>icon-moving</title>
                <path d="M4 12H20M4 12L8 8M4 12L8 16" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-4 -4 30 30" id="svgaddfriend">
                <title>icon-accepte</title>
                <path d="M17,17h4m-2-2v4" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round"></path>
                <path d="M14,13.29A6.91,6.91,0,0,0,12,13H10a7,7,0,0,0-7,7,1,1,0,0,0,1,1H15" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round"></path>
                <circle cx="11" cy="8" r="5" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round"></circle>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-4 -4 30 30" id="svgaddfriend2">
                <title>icon-accepte</title>
                <path d="M 19,14.25 A 0.75,0.75 0 0 0 18.25,15 v 1.25 H 17 A 0.75,0.75 0 0 0 16.25,17 0.75,0.75 0 0 0 17,17.75 h 1.25 V 19 A 0.75,0.75 0 0 0 19,19.75 0.75,0.75 0 0 0 19.75,19 V 17.75 H 21 A 0.75,0.75 0 0 0 21.75,17 0.75,0.75 0 0 0 21,16.25 H 19.75 V 15 A 0.75,0.75 0 0 0 19,14.25 Z"></path>
                <path d="m 10,12.25 c -4.2713191,0 -7.75,3.478681 -7.75,7.75 0,0.957614 0.7923861,1.75 1.75,1.75 H 15 A 0.75,0.75 0 0 0 15.75,21 0.75,0.75 0 0 0 15,20.25 H 4 C 3.8530455,20.25 3.75,20.146955 3.75,20 3.75,16.53934 6.5393403,13.75 10,13.75 h 2 a 0.750075,0.750075 0 0 0 0.002,0 c 0.603767,-0.0017 1.204775,0.08473 1.783203,0.257813 A 0.75,0.75 0 0 0 14.71875,13.505859 0.75,0.75 0 0 0 14.214844,12.572266 C 13.49619,12.35722 12.750129,12.248119 12,12.25 Z"></path>
                <path d="M 11,2.25 C 7.8332446,2.25 5.25,4.8332485 5.25,8 c 0,3.166751 2.5832446,5.75 5.75,5.75 3.166755,0 5.75,-2.583249 5.75,-5.75 0,-3.1667515 -2.583245,-5.75 -5.75,-5.75 z m 0,1.5 c 2.356098,0 4.25,1.8939095 4.25,4.25 0,2.35609 -1.893902,4.25 -4.25,4.25 C 8.6439024,12.25 6.75,10.35609 6.75,8 6.75,5.6439095 8.6439024,3.75 11,3.75 Z"></path>
            </symbol>
        </svg>
        
        
        <svg display="none">
            <symbol viewBox="-16 -16 64 64" id="svgoptions">
                <title>icon-options</title>
                <path d="M12.15 28.012v-0.85c0.019-0.069 0.050-0.131 0.063-0.2 0.275-1.788 1.762-3.2 3.506-3.319 1.95-0.137 3.6 0.975 4.137 2.787 0.069 0.238 0.119 0.488 0.181 0.731v0.85c-0.019 0.056-0.050 0.106-0.056 0.169-0.269 1.65-1.456 2.906-3.081 3.262-0.125 0.025-0.25 0.063-0.375 0.094h-0.85c-0.056-0.019-0.113-0.050-0.169-0.056-1.625-0.262-2.862-1.419-3.237-3.025-0.037-0.156-0.081-0.3-0.119-0.444zM20.038 3.988l-0 0.85c-0.019 0.069-0.050 0.131-0.056 0.2-0.281 1.8-1.775 3.206-3.538 3.319-1.944 0.125-3.588-1-4.119-2.819-0.069-0.231-0.119-0.469-0.175-0.7v-0.85c0.019-0.056 0.050-0.106 0.063-0.162 0.3-1.625 1.244-2.688 2.819-3.194 0.206-0.069 0.425-0.106 0.637-0.162h0.85c0.056 0.019 0.113 0.050 0.169 0.056 1.631 0.269 2.863 1.419 3.238 3.025 0.038 0.15 0.075 0.294 0.113 0.437zM20.037 15.575v0.85c-0.019 0.069-0.050 0.131-0.063 0.2-0.281 1.794-1.831 3.238-3.581 3.313-1.969 0.087-3.637-1.1-4.106-2.931-0.050-0.194-0.094-0.387-0.137-0.581v-0.85c0.019-0.069 0.050-0.131 0.063-0.2 0.275-1.794 1.831-3.238 3.581-3.319 1.969-0.094 3.637 1.1 4.106 2.931 0.050 0.2 0.094 0.394 0.137 0.588z"></path>
            </symbol>
        </svg>
        
        
        <svg display="none">
            <symbol viewBox="-16 -16 64 64" id="svgpostlike">
                <title>icon-like2</title>
                <path d="M21.886 5.115c3.521 0 6.376 2.855 6.376 6.376 0 1.809-0.754 3.439-1.964 4.6l-10.297 10.349-10.484-10.536c-1.1-1.146-1.778-2.699-1.778-4.413 0-3.522 2.855-6.376 6.376-6.376 2.652 0 4.925 1.62 5.886 3.924 0.961-2.304 3.234-3.924 5.886-3.924zM21.886 4.049c-2.345 0-4.499 1.089-5.886 2.884-1.386-1.795-3.54-2.884-5.886-2.884-4.104 0-7.442 3.339-7.442 7.442 0 1.928 0.737 3.758 2.075 5.152l11.253 11.309 11.053-11.108c1.46-1.402 2.275-3.308 2.275-5.352 0-4.104-3.339-7.442-7.442-7.442v0z" stroke-width="2.0" stroke-linecap="round" stroke-linejoin="round" ></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 1024 1024" id="svgsetting">
                <title>icon-setting</title>
                <path d="M600.704 64a32 32 0 0 1 30.464 22.208l35.2 109.376c14.784 7.232 28.928 15.36 42.432 24.512l112.384-24.192a32 32 0 0 1 34.432 15.36L944.32 364.8a32 32 0 0 1-4.032 37.504l-77.12 85.12a357.12 357.12 0 0 1 0 49.024l77.12 85.248a32 32 0 0 1 4.032 37.504l-88.704 153.6a32 32 0 0 1-34.432 15.296L708.8 803.904c-13.44 9.088-27.648 17.28-42.368 24.512l-35.264 109.376A32 32 0 0 1 600.704 960H423.296a32 32 0 0 1-30.464-22.208L357.696 828.48a351.616 351.616 0 0 1-42.56-24.64l-112.32 24.256a32 32 0 0 1-34.432-15.36L79.68 659.2a32 32 0 0 1 4.032-37.504l77.12-85.248a357.12 357.12 0 0 1 0-48.896l-77.12-85.248A32 32 0 0 1 79.68 364.8l88.704-153.6a32 32 0 0 1 34.432-15.296l112.32 24.256c13.568-9.152 27.776-17.408 42.56-24.64l35.2-109.312A32 32 0 0 1 423.232 64H600.64zm-23.424 64H446.72l-36.352 113.088-24.512 11.968a294.113 294.113 0 0 0-34.816 20.096l-22.656 15.36-116.224-25.088-65.28 113.152 79.68 88.192-1.92 27.136a293.12 293.12 0 0 0 0 40.192l1.92 27.136-79.808 88.192 65.344 113.152 116.224-25.024 22.656 15.296a294.113 294.113 0 0 0 34.816 20.096l24.512 11.968L446.72 896h130.688l36.48-113.152 24.448-11.904a288.282 288.282 0 0 0 34.752-20.096l22.592-15.296 116.288 25.024 65.28-113.152-79.744-88.192 1.92-27.136a293.12 293.12 0 0 0 0-40.256l-1.92-27.136 79.808-88.128-65.344-113.152-116.288 24.96-22.592-15.232a287.616 287.616 0 0 0-34.752-20.096l-24.448-11.904L577.344 128zM512 320a192 192 0 1 1 0 384 192 192 0 0 1 0-384zm0 64a128 128 0 1 0 0 256 128 128 0 0 0 0-256z"></path>
            </symbol>
        </svg>
        
        
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgedit">
                <title>icon-edit</title>
                <path d="M18.3785 8.44975L11.4637 15.3647C11.1845 15.6439 10.8289 15.8342 10.4417 15.9117L7.49994 16.5L8.08829 13.5582C8.16572 13.1711 8.35603 12.8155 8.63522 12.5363L15.5501 5.62132M18.3785 8.44975L19.7927 7.03553C20.1832 6.64501 20.1832 6.01184 19.7927 5.62132L18.3785 4.20711C17.988 3.81658 17.3548 3.81658 16.9643 4.20711L15.5501 5.62132M18.3785 8.44975L15.5501 5.62132" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                <path d="M5 20H19" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgedit2">
                <title>icon-edit</title>
                <path d="m 17.671875,3.3183594 c -0.410738,0 -0.822909,0.1549165 -1.132813,0.4648437 L 15.125,5.1972656 8.2109375,12.111328 C 7.8480295,12.474249 7.6006558,12.938192 7.5,13.441406 l -0.5878906,2.941406 a 0.60006002,0.60006002 0 0 0 0.7050781,0.705079 L 10.558594,16.5 c 0.503221,-0.100722 0.96715,-0.34801 1.330078,-0.710937 l 6.914062,-6.9160161 1.414063,-1.4140625 c 0.619787,-0.6198189 0.619787,-1.6418999 0,-2.2617188 L 18.802734,3.7832031 C 18.492831,3.4732759 18.082613,3.3183594 17.671875,3.3183594 Z m -0.283203,1.3125 c 0.161192,-0.1612048 0.405214,-0.1612048 0.566406,0 l 1.414063,1.4140625 c 0.161212,0.1612203 0.161212,0.4051859 0,0.5664062 L 18.378906,7.6015625 16.398437,5.6210937 Z M 15.550781,6.46875 17.53125,8.4492188 11.039063,14.941406 c -0.195472,0.195472 -0.443666,0.328535 -0.714844,0.382813 l -2.0605471,0.412109 0.4121094,-2.060547 c 0.054204,-0.270985 0.187341,-0.519365 0.3828125,-0.714843 z" ></path>
                <path d="M 5,19.400391 A 0.60000002,0.60000002 0 0 0 4.4003906,20 0.60000002,0.60000002 0 0 0 5,20.599609 H 19 A 0.60000002,0.60000002 0 0 0 19.599609,20 0.60000002,0.60000002 0 0 0 19,19.400391 Z"></path>
            </symbol>
        </svg>
        
        
        <svg display="none">
            <symbol viewBox="-8 -8 40 40" id="svgtrash">
                <title>icon-trash</title>
                <path d="M4 6H20M16 6L15.7294 5.18807C15.4671 4.40125 15.3359 4.00784 15.0927 3.71698C14.8779 3.46013 14.6021 3.26132 14.2905 3.13878C13.9376 3 13.523 3 12.6936 3H11.3064C10.477 3 10.0624 3 9.70951 3.13878C9.39792 3.26132 9.12208 3.46013 8.90729 3.71698C8.66405 4.00784 8.53292 4.40125 8.27064 5.18807L8 6M18 6V16.2C18 17.8802 18 18.7202 17.673 19.362C17.3854 19.9265 16.9265 20.3854 16.362 20.673C15.7202 21 14.8802 21 13.2 21H10.8C9.11984 21 8.27976 21 7.63803 20.673C7.07354 20.3854 6.6146 19.9265 6.32698 19.362C6 18.7202 6 17.8802 6 16.2V6M14 10V17M10 10V17" stroke-width="2.2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        
        <svg display="none">
            <symbol viewBox="-3 -3 30 30" id="svgdirect">
                <title>icon-ignore-2</title>
                <path d="M12.1657 2.14424C12.8728 2.50021 13 3.27314 13 3.7446V20.2561C13 20.7286 12.8717 21.4998 12.1656 21.8554C11.416 22.2331 10.7175 21.8081 10.3623 21.4891L4.95001 16.6248H3.00001C1.89544 16.6248 1.00001 15.7293 1.00001 14.6248L1 9.43717C1 8.3326 1.89543 7.43717 3 7.43717H4.94661L10.3623 2.51158C10.7163 2.19354 11.4151 1.76635 12.1657 2.14424ZM11 4.63507L6.00618 9.17696C5.82209 9.34439 5.58219 9.43717 5.33334 9.43717H3L3.00001 14.6248H5.33334C5.58015 14.6248 5.81823 14.716 6.00179 14.881L11 19.3731V4.63507Z" stroke-width="1.75" stroke-linecap="round" stroke-linejoin="round"></path>
                
                <path d="M16.0368 4.73124C16.1852 4.19927 16.7368 3.88837 17.2688 4.03681C20.6116 4.9696 23 8.22106 23 12C23 15.779 20.6116 19.0304 17.2688 19.9632C16.7368 20.1117 16.1852 19.8007 16.0368 19.2688C15.8884 18.7368 16.1993 18.1852 16.7312 18.0368C19.1391 17.3649 21 14.9567 21 12C21 9.04332 19.1391 6.63512 16.7312 5.96321C16.1993 5.81477 15.8884 5.2632 16.0368 4.73124Z" stroke-width="1.75" stroke-linecap="round" stroke-linejoin="round"></path>
                
                <path d="M16.2865 8.04192C15.7573 7.88372 15.2001 8.18443 15.0419 8.71357C14.8837 9.24271 15.1844 9.79992 15.7136 9.95812C16.3702 10.1544 17 10.9209 17 12C17 13.0791 16.3702 13.8456 15.7136 14.0419C15.1844 14.2001 14.8837 14.7573 15.0419 15.2865C15.2001 15.8156 15.7573 16.1163 16.2865 15.9581C17.9301 15.4667 19 13.8076 19 12C19 10.1924 17.9301 8.53333 16.2865 8.04192Z" stroke-width="1.75" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-4 -4 32 32" id="svgnavigation">
                <title>icon-moving</title>
                
                <!--<path d="M4 12H20M4 12L8 8M4 12L8 16" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>-->
                <line class="c" x1="8.62" x2="15.38" y1="12" y2="5.5" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                <line class="c" x1="8.62" x2="15.38" y1="12" y2="18.5" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-4 -4 32 32" id="svgnavigationR" transform="matrix(-1,0,0,1,24,0)">
                <title>icon-moving</title>
                
                <!--<path d="M4 12H20M4 12L8 8M4 12L8 16" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>-->
                <line class="c" x1="8.62" x2="15.38" y1="12" y2="5.5" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                <line class="c" x1="8.62" x2="15.38" y1="12" y2="18.5" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-4 -4 32 32" id="svgnavR2">
                <title>icon-moving</title>
                <path d="m 6.9482977,2.0019531 a -1,1 0 0 1 0.720703,0.2539063 L 17.670954,11.259766 a -1.0001,1.0001 0 0 1 0,1.486328 L 7.6690007,21.748047 a -1,1 0 0 1 -1.41211,-0.07422 -1,1 0 0 1 0.07422,-1.412109 L 15.504938,12.003906 6.3311097,3.7441406 a -1,1 0 0 1 -0.07422,-1.4140625 -1,1 0 0 1 0.691408,-0.328125 z"></path>
                
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="-4 -4 32 32" id="svgnavL2">
                <title>icon-moving</title>
                <path d="M 17.052734,2.0019531 A 1,1 0 0 0 16.332031,2.2558594 L 6.3300781,11.259766 a 1.0001,1.0001 0 0 0 0,1.486328 l 10.0019529,9.001953 a 1,1 0 0 0 1.41211,-0.07422 1,1 0 0 0 -0.07422,-1.412109 L 8.4960938,12.003906 17.669922,3.7441406 a 1,1 0 0 0 0.07422,-1.4140625 1,1 0 0 0 -0.691407,-0.328125 z"></path>
                
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 32 32" id="svgstartdark">
                <title>icon-star</title>
                <path d="M30.859 12.545c-0.168-0.506-0.637-0.864-1.189-0.864h-9.535l-2.946-9.067c-0.208-0.459-0.662-0.772-1.188-0.772s-0.981 0.313-1.185 0.764l-0.003 0.008-2.946 9.067h-9.534c-0.69 0-1.25 0.56-1.25 1.25 0 0.414 0.202 0.782 0.512 1.009l0.004 0.002 7.713 5.603-2.946 9.068c-0.039 0.116-0.061 0.249-0.061 0.387 0 0.69 0.56 1.25 1.25 1.25 0.276 0 0.531-0.089 0.738-0.241l-0.004 0.002 7.714-5.605 7.713 5.605c0.203 0.149 0.458 0.238 0.734 0.238 0.691 0 1.251-0.56 1.251-1.251 0-0.138-0.022-0.271-0.064-0.395l0.003 0.009-2.947-9.066 7.715-5.604c0.314-0.231 0.515-0.598 0.515-1.013 0-0.137-0.022-0.27-0.063-0.393l0.003 0.009z" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        
        <svg display="none">
            <symbol viewBox="0 0 32 32" id="svgstartlight">
                <title>icon-star</title>
                <path d="M30.859 12.545c-0.168-0.506-0.637-0.864-1.189-0.864h-9.535l-2.946-9.067c-0.208-0.459-0.662-0.772-1.188-0.772s-0.981 0.313-1.185 0.764l-0.003 0.008-2.946 9.067h-9.534c-0.69 0-1.25 0.56-1.25 1.25 0 0.414 0.202 0.782 0.512 1.009l0.004 0.002 7.713 5.603-2.946 9.068c-0.039 0.116-0.061 0.249-0.061 0.387 0 0.69 0.56 1.25 1.25 1.25 0.276 0 0.531-0.089 0.738-0.241l-0.004 0.002 7.714-5.605 7.713 5.605c0.203 0.149 0.458 0.238 0.734 0.238 0.691 0 1.251-0.56 1.251-1.251 0-0.138-0.022-0.271-0.064-0.395l0.003 0.009-2.947-9.066 7.715-5.604c0.314-0.231 0.515-0.598 0.515-1.013 0-0.137-0.022-0.27-0.063-0.393l0.003 0.009zM20.486 18.057c-0.314 0.231-0.515 0.599-0.515 1.014 0 0.137 0.022 0.27 0.063 0.394l-0.003-0.009 2.039 6.271-5.336-3.877c-0.203-0.149-0.458-0.238-0.734-0.238s-0.531 0.089-0.738 0.241l0.004-0.002-5.336 3.877 2.038-6.271c0.039-0.116 0.062-0.249 0.062-0.387 0-0.414-0.202-0.781-0.512-1.009l-0.004-0.002-5.335-3.876h6.595c0 0 0 0 0.001 0 0.552 0 1.020-0.358 1.185-0.854l0.003-0.009 2.038-6.272 2.037 6.272c0.169 0.505 0.637 0.863 1.189 0.863h6.596z" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 32 32" id="svgstarthalf2">
                <title>icon-star</title>
                <path d="M30.859 12.545c-0.168-0.506-0.637-0.864-1.189-0.864h-9.535l-2.946-9.067c-0.168-0.505-0.636-0.863-1.188-0.863-0.138 0-0.272 0.023-0.396 0.064l0.009-0.003c-0.376 0.13-0.664 0.427-0.779 0.8l-0.002 0.009-0.021-0.007-2.946 9.067h-9.534c-0.69 0-1.25 0.56-1.25 1.25 0 0.414 0.202 0.782 0.512 1.009l0.004 0.002 7.713 5.603-2.946 9.068c-0.039 0.116-0.061 0.249-0.061 0.387 0 0.69 0.56 1.25 1.25 1.25 0.276 0 0.531-0.089 0.738-0.241l-0.004 0.002 7.714-5.605 7.713 5.605c0.203 0.149 0.458 0.238 0.734 0.238 0.691 0 1.251-0.56 1.251-1.251 0-0.138-0.022-0.271-0.064-0.395l0.003 0.009-2.947-9.066 7.715-5.604c0.314-0.231 0.515-0.598 0.515-1.013 0-0.137-0.022-0.27-0.063-0.393l0.003 0.009zM20.486 18.057c-0.314 0.231-0.515 0.599-0.515 1.014 0 0.137 0.022 0.27 0.063 0.394l-0.003-0.009 2.039 6.271-5.336-3.877c-0.194-0.135-0.435-0.215-0.694-0.215-0.014 0-0.028 0-0.042 0.001l0.002-0v-14.589l2.037 6.272c0.169 0.505 0.637 0.863 1.189 0.863h6.596z" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 32 32" id="svgstarthalf">
                <title>icon-star</title>
                <!--تم قلب الوجه باستخدام انكسكيب-->
                <path d="m 1.145,12.545 c 0.168,-0.506 0.637,-0.864 1.189,-0.864 h 9.535 l 2.946,-9.067 c 0.168,-0.505 0.636,-0.863 1.188,-0.863 0.138,0 0.272,0.023 0.396,0.064 L 16.39,1.812 c 0.376,0.13 0.664,0.427 0.779,0.8 l 0.002,0.009 0.021,-0.007 2.946,9.067 h 9.534 c 0.69,0 1.25,0.56 1.25,1.25 0,0.414 -0.202,0.782 -0.512,1.009 l -0.004,0.002 -7.713,5.603 2.946,9.068 c 0.039,0.116 0.061,0.249 0.061,0.387 0,0.69 -0.56,1.25 -1.25,1.25 -0.276,0 -0.531,-0.089 -0.738,-0.241 l 0.004,0.002 -7.714,-5.605 -7.713,5.605 c -0.203,0.149 -0.458,0.238 -0.734,0.238 -0.691,0 -1.251,-0.56 -1.251,-1.251 0,-0.138 0.022,-0.271 0.064,-0.395 L 6.365,28.612 9.312,19.546 1.597,13.942 C 1.283,13.711 1.082,13.344 1.082,12.929 c 0,-0.137 0.022,-0.27 0.063,-0.393 l -0.003,0.009 z m 10.373,5.512 c 0.314,0.231 0.515,0.599 0.515,1.014 0,0.137 -0.022,0.27 -0.063,0.394 l 0.003,-0.009 -2.039,6.271 5.336,-3.877 c 0.194,-0.135 0.435,-0.215 0.694,-0.215 0.014,0 0.028,0 0.042,10e-4 H 16.004 V 7.047 l -2.037,6.272 c -0.169,0.505 -0.637,0.863 -1.189,0.863 H 6.182 Z" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        
        <!--from profile-->
        
        <svg display="none">
            <symbol viewBox="-4 -4 32 32" id="svgnavigation_L">
                <title>icon-moving</title>
                
                <!--<path d="M4 12H20M4 12L8 8M4 12L8 16" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>-->
                <line class="c" x1="8.62" x2="15.38" y1="12" y2="5.5" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                <line class="c" x1="8.62" x2="15.38" y1="12" y2="18.5" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-4 -4 32 32" id="svgnavigation_R">
                <title>icon-moving</title>
                <g transform="matrix(-1,0,0,1,24,0)">
                    <!--<path d="M4 12H20M4 12L8 8M4 12L8 16" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>-->
                    <line class="c" x1="8.62" x2="15.38" y1="12" y2="5.5" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                    <line class="c" x1="8.62" x2="15.38" y1="12" y2="18.5" fill="none" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                </g>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgemail">
                <title>icon-email</title>
                <path d="M4 7.00005L10.2 11.65C11.2667 12.45 12.7333 12.45 13.8 11.65L20 7" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                <rect x="3" y="5" width="18" height="14" rx="2" stroke-width="2" stroke-linecap="round"/>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgemail2">
                <title>icon-email</title>
                <path d="M 3.8945313,6.2578125 A 0.75,0.75 0 0 0 3.4003906,6.5507812 0.75,0.75 0 0 0 3.5507813,7.5996094 L 9.75,12.25 c 1.330679,0.997978 3.169321,0.997978 4.5,0 l 6.199219,-4.6503906 a 0.75,0.75 0 0 0 0.15039,-1.0488282 0.75,0.75 0 0 0 -1.048828,-0.1503906 l -6.201172,4.6503904 c -0.802718,0.602021 -1.8965,0.602021 -2.699218,0 L 4.4492187,6.4003906 A 0.75,0.75 0 0 0 3.8945313,6.2578125 Z"></path>
                <path d="M 5,4.25 C 3.4894744,4.25 2.25,5.4894744 2.25,7 v 10 c 0,1.510526 1.2394744,2.75 2.75,2.75 h 14 c 1.510526,0 2.75,-1.239474 2.75,-2.75 V 7 C 21.75,5.4894744 20.510526,4.25 19,4.25 Z m 0,1.5 h 14 c 0.705472,0 1.25,0.5445278 1.25,1.25 v 10 c 0,0.705472 -0.544528,1.25 -1.25,1.25 H 5 C 4.2945278,18.25 3.75,17.705472 3.75,17 V 7 C 3.75,6.2945278 4.2945278,5.75 5,5.75 Z"></path>
            </symbol>
        </svg>

        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgphone">
                <title>icon-phone</title>
                <path d="M9 2C9 1.44772 9.44772 1 10 1H14C14.5523 1 15 1.44772 15 2V3C15 3.55228 14.5523 4 14 4H10C9.44772 4 9 3.55228 9 3V2Z" ></path>
                <rect x="5.75" y="1.75" width="12.5" height="20.5" rx="1.75" stroke-width="1.5"/>
                <path d="M9 19.5H15" stroke-width="1.5" stroke-linecap="round"/>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgphone2">
                <title>icon-phone</title>
                <path d="M9 2C9 1.44772 9.44772 1 10 1H14C14.5523 1 15 1.44772 15 2V3C15 3.55228 14.5523 4 14 4H10C9.44772 4 9 3.55228 9 3V2Z" ></path>
                <path d="M 9,18.75 A 0.75,0.75 0 0 0 8.25,19.5 0.75,0.75 0 0 0 9,20.25 h 6 A 0.75,0.75 0 0 0 15.75,19.5 0.75,0.75 0 0 0 15,18.75 Z" ></path>
                <path d="M 7.5,1 C 6.1279743,1 5,2.1279743 5,3.5 v 17 C 5,21.872026 6.1279743,23 7.5,23 h 9 C 17.872026,23 19,21.872026 19,20.5 V 3.5 C 19,2.1279743 17.872026,1 16.5,1 Z m 0,1.5 h 9 c 0.566972,0 1,0.4330276 1,1 v 17 c 0,0.566972 -0.433028,1 -1,1 h -9 c -0.5669724,0 -1,-0.433028 -1,-1 v -17 c 0,-0.5669724 0.4330276,-1 1,-1 z"/>
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svglink">
                <title>icon-link</title>
                <path d="M14.5454 9.95475C14.2525 9.66186 13.7776 9.66188 13.4847 9.95478C13.1919 10.2477 13.1919 10.7226 13.4848 11.0154L14.5454 9.95475ZM14.0151 15.0291L13.4848 14.4987L13.4848 14.4988L14.0151 15.0291ZM10.9851 18.0591L11.5154 18.5894L10.9851 18.0591ZM6.44109 13.5151L6.97142 14.0454H6.97142L6.44109 13.5151ZM8.48642 12.5304C8.77932 12.2375 8.77932 11.7627 8.48642 11.4698C8.19353 11.1769 7.71866 11.1769 7.42576 11.4698L8.48642 12.5304ZM10.4548 14.0454C10.7477 14.3383 11.2226 14.3383 11.5154 14.0454C11.8083 13.7525 11.8083 13.2776 11.5154 12.9847L10.4548 14.0454ZM10.9851 8.97109L11.5154 9.50144L11.5154 9.50142L10.9851 8.97109ZM14.0151 5.94109L14.5454 6.47142L14.0151 5.94109ZM18.5591 5.94109L18.0288 6.47142V6.47142L18.5591 5.94109ZM18.5591 10.4851L19.0894 11.0154L18.5591 10.4851ZM16.5138 11.4698C16.2209 11.7627 16.2209 12.2375 16.5138 12.5304C16.8067 12.8233 17.2815 12.8233 17.5744 12.5304L16.5138 11.4698ZM13.4848 11.0154C13.9467 11.4773 14.2062 12.1038 14.2062 12.7571H15.7062C15.7062 11.706 15.2887 10.698 14.5454 9.95475L13.4848 11.0154ZM14.2062 12.7571C14.2062 13.4103 13.9467 14.0368 13.4848 14.4987L14.5454 15.5594C15.2887 14.8162 15.7062 13.8082 15.7062 12.7571H14.2062ZM13.4848 14.4988L10.4548 17.5288L11.5154 18.5894L14.5454 15.5594L13.4848 14.4988ZM10.4548 17.5288C9.49287 18.4907 7.93332 18.4907 6.97142 17.5288L5.91076 18.5894C7.45845 20.1371 9.96774 20.1371 11.5154 18.5894L10.4548 17.5288ZM6.97142 17.5288C6.00953 16.5669 6.00953 15.0073 6.97142 14.0454L5.91076 12.9848C4.36308 14.5324 4.36308 17.0417 5.91076 18.5894L6.97142 17.5288ZM6.97142 14.0454L8.48642 12.5304L7.42576 11.4698L5.91076 12.9848L6.97142 14.0454ZM11.5154 12.9847C11.0535 12.5228 10.794 11.8963 10.794 11.2431H9.29396C9.29396 12.2942 9.71152 13.3022 10.4548 14.0454L11.5154 12.9847ZM10.794 11.2431C10.794 10.5898 11.0535 9.96335 11.5154 9.50144L10.4548 8.44075C9.71152 9.18396 9.29396 10.192 9.29396 11.2431H10.794ZM11.5154 9.50142L14.5454 6.47142L13.4848 5.41076L10.4548 8.44076L11.5154 9.50142ZM14.5454 6.47142C15.5073 5.50953 17.0669 5.50953 18.0288 6.47142L19.0894 5.41076C17.5417 3.86308 15.0324 3.86308 13.4848 5.41076L14.5454 6.47142ZM18.0288 6.47142C18.9907 7.43332 18.9907 8.99287 18.0288 9.95476L19.0894 11.0154C20.6371 9.46774 20.6371 6.95845 19.0894 5.41076L18.0288 6.47142ZM18.0288 9.95476L16.5138 11.4698L17.5744 12.5304L19.0894 11.0154L18.0288 9.95476Z" fill="#000000"></path>
            </symbol>
        </svg>

        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgwebsite">
                <title>icon-website</title>
                <path id="vector (Stroke)" fill-rule="evenodd" clip-rule="evenodd" d="M10.4425 2.44429C10.0752 3.64002 9.32073 6.25569 8.89915 8.83258C9.99331 9.00921 11.0621 9.12209 12 9.12209C12.9379 9.12209 14.0067 9.00921 15.1009 8.83258C14.6793 6.25569 13.9248 3.64002 13.5575 2.44429C13.0509 2.3624 12.5307 2.31977 12 2.31977C11.4693 2.31977 10.9491 2.3624 10.4425 2.44429ZM15.3337 2.90893C15.737 4.305 16.2958 6.42828 16.6448 8.54737C18.1513 8.23703 19.5727 7.85824 20.605 7.56109C19.4986 5.42102 17.6172 3.74662 15.3337 2.90893ZM21.2129 9.01933C20.1222 9.33683 18.5423 9.76328 16.8594 10.1057C16.9295 10.7564 16.9709 11.3958 16.9709 12C16.9709 12.8816 16.8827 13.8411 16.7445 14.8058C18.759 14.3858 20.6068 13.849 21.5557 13.5575C21.6376 13.0509 21.6802 12.5307 21.6802 12C21.6802 10.959 21.5162 9.95751 21.2129 9.01933ZM21.0911 15.3337C19.9166 15.6729 18.229 16.1219 16.4634 16.4634C16.1219 18.229 15.6729 19.9166 15.3337 21.0911C17.9978 20.1138 20.1138 17.9978 21.0911 15.3337ZM13.5576 21.5557C13.849 20.6068 14.3858 18.759 14.8058 16.7445C13.8411 16.8827 12.8816 16.9709 12 16.9709C11.1184 16.9709 10.1589 16.8827 9.19423 16.7445C9.61421 18.759 10.151 20.6068 10.4425 21.5557C10.9491 21.6376 11.4693 21.6802 12 21.6802C12.5307 21.6802 13.0509 21.6376 13.5576 21.5557ZM8.66629 21.0911C8.32707 19.9166 7.8781 18.229 7.53658 16.4634C5.77099 16.1219 4.08335 15.6729 2.90891 15.3337C3.88622 17.9978 6.00216 20.1138 8.66629 21.0911ZM2.44429 13.5575C3.39316 13.849 5.24101 14.3858 7.25548 14.8058C7.1173 13.8411 7.02907 12.8816 7.02907 12C7.02907 11.3958 7.07048 10.7564 7.14056 10.1057C5.45769 9.76328 3.87779 9.33683 2.78712 9.01933C2.48383 9.95751 2.31977 10.959 2.31977 12C2.31977 12.5307 2.3624 13.0509 2.44429 13.5575ZM3.39504 7.56109C4.42731 7.85824 5.84865 8.23703 7.35522 8.54737C7.70416 6.42827 8.26303 4.305 8.66626 2.90893C6.38282 3.74662 4.50139 5.42102 3.39504 7.56109ZM8.68924 10.3888C8.63137 10.9544 8.59884 11.4968 8.59884 12C8.59884 12.9399 8.71224 14.012 8.88985 15.1102C9.98798 15.2878 11.0601 15.4012 12 15.4012C12.9399 15.4012 14.012 15.2878 15.1102 15.1102C15.2878 14.012 15.4012 12.9399 15.4012 12C15.4012 11.4968 15.3686 10.9544 15.3108 10.3888C14.1776 10.5703 13.0348 10.6919 12 10.6919C10.9652 10.6919 9.82236 10.5703 8.68924 10.3888ZM9.67273 0.991173C10.4243 0.833026 11.2029 0.75 12 0.75C12.7971 0.75 13.5757 0.833026 14.3273 0.991174C18.0108 1.76627 21.0281 4.34097 22.42 7.75174C22.9554 9.06356 23.25 10.4983 23.25 12C23.25 12.7971 23.167 13.5757 23.0088 14.3273C22.0943 18.6736 18.6736 22.0943 14.3273 23.0088C13.5757 23.167 12.7971 23.25 12 23.25C11.2029 23.25 10.4243 23.167 9.67273 23.0088C5.32644 22.0943 1.90572 18.6736 0.991173 14.3273C0.833026 13.5757 0.75 12.7971 0.75 12C0.75 10.4972 1.04509 9.06132 1.58123 7.74866C2.97369 4.33943 5.99026 1.76604 9.67273 0.991173Z"></path>
                <defs>
                <clipPath id="clip0_1_1828">
                <rect width="24" height="24" fill="#00ff00"/>
                </clipPath>
                </defs>
            </symbol>
        </svg>

        <svg display="none">
            <symbol viewBox="0 0 24 24" id="svgwebsite2">
                <title>icon-website2</title>
                <path fill-rule="evenodd" clip-rule="evenodd" d="M9.83824 18.4467C10.0103 18.7692 10.1826 19.0598 10.3473 19.3173C8.59745 18.9238 7.07906 17.9187 6.02838 16.5383C6.72181 16.1478 7.60995 15.743 8.67766 15.4468C8.98112 16.637 9.40924 17.6423 9.83824 18.4467ZM11.1618 17.7408C10.7891 17.0421 10.4156 16.1695 10.1465 15.1356C10.7258 15.0496 11.3442 15 12.0001 15C12.6559 15 13.2743 15.0496 13.8535 15.1355C13.5844 16.1695 13.2109 17.0421 12.8382 17.7408C12.5394 18.3011 12.2417 18.7484 12 19.0757C11.7583 18.7484 11.4606 18.3011 11.1618 17.7408ZM9.75 12C9.75 12.5841 9.7893 13.1385 9.8586 13.6619C10.5269 13.5594 11.2414 13.5 12.0001 13.5C12.7587 13.5 13.4732 13.5593 14.1414 13.6619C14.2107 13.1384 14.25 12.5841 14.25 12C14.25 11.4159 14.2107 10.8616 14.1414 10.3381C13.4732 10.4406 12.7587 10.5 12.0001 10.5C11.2414 10.5 10.5269 10.4406 9.8586 10.3381C9.7893 10.8615 9.75 11.4159 9.75 12ZM8.38688 10.0288C8.29977 10.6478 8.25 11.3054 8.25 12C8.25 12.6946 8.29977 13.3522 8.38688 13.9712C7.11338 14.3131 6.05882 14.7952 5.24324 15.2591C4.76698 14.2736 4.5 13.168 4.5 12C4.5 10.832 4.76698 9.72644 5.24323 8.74088C6.05872 9.20472 7.1133 9.68686 8.38688 10.0288ZM10.1465 8.86445C10.7258 8.95042 11.3442 9 12.0001 9C12.6559 9 13.2743 8.95043 13.8535 8.86447C13.5844 7.83055 13.2109 6.95793 12.8382 6.2592C12.5394 5.69894 12.2417 5.25156 12 4.92432C11.7583 5.25156 11.4606 5.69894 11.1618 6.25918C10.7891 6.95791 10.4156 7.83053 10.1465 8.86445ZM15.6131 10.0289C15.7002 10.6479 15.75 11.3055 15.75 12C15.75 12.6946 15.7002 13.3521 15.6131 13.9711C16.8866 14.3131 17.9412 14.7952 18.7568 15.2591C19.233 14.2735 19.5 13.1679 19.5 12C19.5 10.8321 19.233 9.72647 18.7568 8.74093C17.9413 9.20477 16.8867 9.6869 15.6131 10.0289ZM17.9716 7.46178C17.2781 7.85231 16.39 8.25705 15.3224 8.55328C15.0189 7.36304 14.5908 6.35769 14.1618 5.55332C13.9897 5.23077 13.8174 4.94025 13.6527 4.6827C15.4026 5.07623 16.921 6.08136 17.9716 7.46178ZM8.67765 8.55325C7.61001 8.25701 6.7219 7.85227 6.02839 7.46173C7.07906 6.08134 8.59745 5.07623 10.3472 4.6827C10.1826 4.94025 10.0103 5.23076 9.83823 5.5533C9.40924 6.35767 8.98112 7.36301 8.67765 8.55325ZM15.3224 15.4467C15.0189 16.637 14.5908 17.6423 14.1618 18.4467C13.9897 18.7692 13.8174 19.0598 13.6527 19.3173C15.4026 18.9238 16.921 17.9186 17.9717 16.5382C17.2782 16.1477 16.3901 15.743 15.3224 15.4467ZM12 21C16.9706 21 21 16.9706 21 12C21 7.02944 16.9706 3 12 3C7.02944 3 3 7.02944 3 12C3 16.9706 7.02944 21 12 21Z"></path>
            </symbol>
        </svg>
        
        
        <svg display="none">
            <symbol viewBox="0 0 36 36" id="notificatiosuccess">
                <title>icon-notificatiosuccess</title>
                <path d="M18,2A16,16,0,1,0,34,18,16,16,0,0,0,18,2Zm0,30A14,14,0,1,1,32,18,14,14,0,0,1,18,32Z" stroke-width="2" stroke-linecap="round"></path>
                <path d="M28,12.1a1,1,0,0,0-1.41,0L15.49,23.15l-6-6A1,1,0,0,0,8,18.53L15.49,26,28,13.52A1,1,0,0,0,28,12.1Z" stroke-width="2" stroke-linecap="round"></path>
                <!--<rect x="0" y="0" width="36" height="36" fill-opacity="0"/>-->
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 24 24" id="notificatiowarning">
                <title>icon-notificatiowarning</title>
                <circle cx="12" cy="17" r="1" fill"#FF0000"/>
                <path d="M12 10L12 14" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                <path d="M3.44722 18.1056L10.2111 4.57771C10.9482 3.10361 13.0518 3.10362 13.7889 4.57771L20.5528 18.1056C21.2177 19.4354 20.2507 21 18.7639 21H5.23607C3.7493 21 2.78231 19.4354 3.44722 18.1056Z" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 36 36" id="notificatioerror">
                <title>icon-notificatioerror</title>
                <path d="M 200,652.36214 C 89.691101,652.36214 -5e-7,742.05324 -5e-7,852.36214 -5e-7,962.67104 89.691101,1052.3622 200,1052.3622 c 110.3089,0 200,-89.69116 200,-200.00006 0,-110.3089 -89.6911,-200 -200,-200 z m 0,25 c 96.7979,0 175,78.2021 175,175 0,96.7979 -78.2021,175.00006 -175,175.00006 -96.7979,0 -175,-78.20216 -175,-175.00006 0,-96.7979 78.2021,-175 175,-175 z m -92.4785,64.8438 -17.677799,17.6777 92.478499,92.4785 -92.478499,92.4785 17.677799,17.6778 92.4785,-92.4785 92.4785,92.4785 17.6777,-17.6778 -92.4785,-92.4785 92.4785,-92.4785 -17.6777,-17.6777 L 200,834.68444 Z"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 16 16" id="notificatioerror2">
                <title>icon-notificatioerror</title>
                <path d="M8.6 1c1.6.1 3.1.9 4.2 2 1.3 1.4 2 3.1 2 5.1 0 1.6-.6 3.1-1.6 4.4-1 1.2-2.4 2.1-4 2.4-1.6.3-3.2.1-4.6-.7-1.4-.8-2.5-2-3.1-3.5C.9 9.2.8 7.5 1.3 6c.5-1.6 1.4-2.9 2.8-3.8C5.4 1.3 7 .9 8.6 1zm.5 12.9c1.3-.3 2.5-1 3.4-2.1.8-1.1 1.3-2.4 1.2-3.8 0-1.6-.6-3.2-1.7-4.3-1-1-2.2-1.6-3.6-1.7-1.3-.1-2.7.2-3.8 1-1.1.8-1.9 1.9-2.3 3.3-.4 1.3-.4 2.7.2 4 .6 1.3 1.5 2.3 2.7 3 1.2.7 2.6.9 3.9.6zM7.9 7.5L10.3 5l.7.7-2.4 2.5 2.4 2.5-.7.7-2.4-2.5-2.4 2.5-.7-.7 2.4-2.5-2.4-2.5.7-.7 2.4 2.5z"></path>
            </symbol>
        </svg>
        
        
        
        <svg display="none">
            <symbol viewBox="-6 -6 36 36" id="svgoutuser34">
                <title>icon-svgoutuser34</title>
                
                
                <g id="layer1">
                <g id="g4">
                    
                <g id="g3" transform="translate(-5)">
                <path d="M 20,12.75 H 9 C 8.80109,12.75 8.61032,12.671 8.46967,12.5303 8.32902,12.3897 8.25,12.1989 8.25,12 8.25,11.8011 8.32902,11.6103 8.46967,11.4697 8.61032,11.329 8.80109,11.25 9,11.25 h 11 c 0.1989,0 0.3897,0.079 0.5303,0.2197 0.1407,0.1406 0.2197,0.3314 0.2197,0.5303 0,0.1989 -0.079,0.3897 -0.2197,0.5303 C 20.3897,12.671 20.1989,12.75 20,12.75 Z"/> 
                </g>
                
                <g id="g2" transform="translate(-5)">
                <path d="m 16,16.7499 c -0.0985,5e-4 -0.1962,-0.0187 -0.2872,-0.0565 -0.091,-0.0378 -0.1736,-0.0934 -0.2428,-0.1635 -0.1404,-0.1406 -0.2193,-0.3312 -0.2193,-0.53 0,-0.1987 0.0789,-0.3894 0.2193,-0.53 l 3.47,-3.47 -3.47,-3.46999 C 15.3963,8.46125 15.3372,8.37845 15.2962,8.28645 15.2552,8.19445 15.2332,8.09513 15.2314,7.99443 15.2296,7.89373 15.2482,7.7937 15.2859,7.70031 15.3236,7.60692 15.3797,7.52209 15.451,7.45087 c 0.0712,-0.07122 0.156,-0.12736 0.2494,-0.16508 0.0934,-0.03772 0.1934,-0.05625 0.2941,-0.05447 0.1007,0.00177 0.2,0.02382 0.292,0.06481 0.092,0.04099 0.1748,0.10009 0.2435,0.17378 l 4,3.99999 c 0.1405,0.1406 0.2193,0.3313 0.2193,0.53 0,0.1988 -0.0788,0.3894 -0.2193,0.53 l -4,4 c -0.0692,0.0701 -0.1518,0.1257 -0.2428,0.1635 -0.091,0.0378 -0.1887,0.057 -0.2872,0.0565 z"/> 
                </g>
                
                <g id="g1" transform="matrix(-1,0,0,1,24,0)">
                <path d="M 9,20.7499 H 6 C 5.65324,20.7647 5.30697,20.7109 4.98101,20.5917 4.65505,20.4725 4.3558,20.2902 4.10038,20.0552 3.84495,19.8202 3.63837,19.5371 3.49246,19.2222 3.34654,18.9073 3.26415,18.5667 3.25,18.2199 V 5.77994 C 3.26415,5.43316 3.34654,5.09256 3.49246,4.77765 3.63837,4.46274 3.84495,4.17969 4.10038,3.9447 4.3558,3.70971 4.65505,3.52739 4.98101,3.40818 5.30697,3.28896 5.65324,3.23519 6,3.24994 h 3 c 0.19891,0 0.38968,0.07902 0.53033,0.21967 C 9.67098,3.61027 9.75,3.80103 9.75,3.99994 9.75,4.19886 9.67098,4.38962 9.53033,4.53027 9.38968,4.67093 9.19891,4.74994 9,4.74994 H 6 C 5.70307,4.72412 5.4076,4.81359 5.17487,4.99977 4.94213,5.18596 4.78999,5.45459 4.75,5.74994 V 18.2199 c 0.03999,0.2954 0.19213,0.564 0.42487,0.7502 C 5.4076,19.1563 5.70307,19.2458 6,19.2199 h 3 c 0.19891,0 0.38968,0.0791 0.53033,0.2197 0.14065,0.1407 0.21967,0.3314 0.21967,0.5303 0,0.199 -0.07902,0.3897 -0.21967,0.5304 C 9.38968,20.6409 9.19891,20.7199 9,20.7199 Z"/> 
                </g>
                
                </g>
                </g>
                
            </symbol>
        </svg>
        
        <svg display="none">
            <symbol viewBox="-6 -6 36 36" id="svgoutuser35">
                <title>icon-svgoutuser35</title>
                
                
                <g id="layer1">
                <g id="g4">
                    
                <g id="g3" transform="matrix(-1,0,0,1,24,0)">
                <path d="M 20,12.75 H 9 C 8.80109,12.75 8.61032,12.671 8.46967,12.5303 8.32902,12.3897 8.25,12.1989 8.25,12 8.25,11.8011 8.32902,11.6103 8.46967,11.4697 8.61032,11.329 8.80109,11.25 9,11.25 h 11 c 0.1989,0 0.3897,0.079 0.5303,0.2197 0.1407,0.1406 0.2197,0.3314 0.2197,0.5303 0,0.1989 -0.079,0.3897 -0.2197,0.5303 C 20.3897,12.671 20.1989,12.75 20,12.75 Z"/> 
                </g>
                
                <g id="g2" transform="matrix(-1,0,0,1,24,0)">
                <path d="m 16,16.7499 c -0.0985,5e-4 -0.1962,-0.0187 -0.2872,-0.0565 -0.091,-0.0378 -0.1736,-0.0934 -0.2428,-0.1635 -0.1404,-0.1406 -0.2193,-0.3312 -0.2193,-0.53 0,-0.1987 0.0789,-0.3894 0.2193,-0.53 l 3.47,-3.47 -3.47,-3.46999 C 15.3963,8.46125 15.3372,8.37845 15.2962,8.28645 15.2552,8.19445 15.2332,8.09513 15.2314,7.99443 15.2296,7.89373 15.2482,7.7937 15.2859,7.70031 15.3236,7.60692 15.3797,7.52209 15.451,7.45087 c 0.0712,-0.07122 0.156,-0.12736 0.2494,-0.16508 0.0934,-0.03772 0.1934,-0.05625 0.2941,-0.05447 0.1007,0.00177 0.2,0.02382 0.292,0.06481 0.092,0.04099 0.1748,0.10009 0.2435,0.17378 l 4,3.99999 c 0.1405,0.1406 0.2193,0.3313 0.2193,0.53 0,0.1988 -0.0788,0.3894 -0.2193,0.53 l -4,4 c -0.0692,0.0701 -0.1518,0.1257 -0.2428,0.1635 -0.091,0.0378 -0.1887,0.057 -0.2872,0.0565 z"/> 
                </g>
                
                <g id="g1" transform="matrix(-1,0,0,1,24,0)">
                <path d="M 9,20.7499 H 6 C 5.65324,20.7647 5.30697,20.7109 4.98101,20.5917 4.65505,20.4725 4.3558,20.2902 4.10038,20.0552 3.84495,19.8202 3.63837,19.5371 3.49246,19.2222 3.34654,18.9073 3.26415,18.5667 3.25,18.2199 V 5.77994 C 3.26415,5.43316 3.34654,5.09256 3.49246,4.77765 3.63837,4.46274 3.84495,4.17969 4.10038,3.9447 4.3558,3.70971 4.65505,3.52739 4.98101,3.40818 5.30697,3.28896 5.65324,3.23519 6,3.24994 h 3 c 0.19891,0 0.38968,0.07902 0.53033,0.21967 C 9.67098,3.61027 9.75,3.80103 9.75,3.99994 9.75,4.19886 9.67098,4.38962 9.53033,4.53027 9.38968,4.67093 9.19891,4.74994 9,4.74994 H 6 C 5.70307,4.72412 5.4076,4.81359 5.17487,4.99977 4.94213,5.18596 4.78999,5.45459 4.75,5.74994 V 18.2199 c 0.03999,0.2954 0.19213,0.564 0.42487,0.7502 C 5.4076,19.1563 5.70307,19.2458 6,19.2199 h 3 c 0.19891,0 0.38968,0.0791 0.53033,0.2197 0.14065,0.1407 0.21967,0.3314 0.21967,0.5303 0,0.199 -0.07902,0.3897 -0.21967,0.5304 C 9.38968,20.6409 9.19891,20.7199 9,20.7199 Z"/> 
                </g>
                
                </g>
                </g>
                
            </symbol>
        </svg>
        
        
        
        <svg display="none">
            <symbol viewBox="0 0 32 32" id="svgstartdark_0">
                <title>icon-star</title>
                <path d="M 26.955815,13.464834 C 26.831954,13.091777 26.486177,12.827836 26.079206,12.827836 H 19.049381 L 16.877397,6.1430509 C 16.724046,5.8046461 16.389327,5.573882 16.001525,5.573882 c -0.387801,0 -0.723257,0.2307641 -0.873659,0.5632708 l -0.0022,0.0059 -2.171984,6.6847852 H 5.9245818 c -0.5087132,0 -0.9215818,0.412869 -0.9215818,0.921582 0,0.305228 0.1489276,0.576542 0.3774799,0.743901 l 0.00295,0.0015 5.6865281,4.130898 -2.1719839,6.685522 C 8.8692198,25.396737 8.853,25.494794 8.853,25.596536 c 0,0.508713 0.4128686,0.921582 0.9215818,0.921582 0.2034852,0 0.3914882,-0.06562 0.5441022,-0.177681 l -0.0029,0.0015 5.687265,-4.132373 5.686528,4.132373 c 0.149665,0.109852 0.337668,0.175469 0.541153,0.175469 0.50945,0 0.922319,-0.412869 0.922319,-0.922319 0,-0.101743 -0.01622,-0.199799 -0.04718,-0.29122 l 0.0022,0.0066 -2.172721,-6.684048 5.688002,-4.131635 c 0.23146,-0.170299 0.37965,-0.440875 0.37965,-0.74684 0,-0.101006 -0.01622,-0.199062 -0.04645,-0.289746 l 0.0022,0.0066 z" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 32 32" id="svgstartlight_0">
                <title>icon-star</title>
                <path d="m 16.001536,5.5738882 c -0.387801,0 -0.723295,0.2307418 -0.873697,0.5632484 l -0.0022,0.00595 -2.171999,6.6847904 H 5.9245782 c -0.508713,0 -0.9216078,0.412825 -0.9216078,0.921537 0,0.305228 0.1489282,0.576572 0.3774803,0.743932 l 0.00294,0.0014 5.6865553,4.130944 -2.1719985,6.685507 c -0.028747,0.08552 -0.044974,0.183569 -0.044974,0.285312 0,0.508713 0.4128948,0.921608 0.9216077,0.921608 0.2034853,0 0.3915138,-0.06561 0.5441268,-0.177676 l -0.0029,0.0014 5.6872,-4.132377 5.686555,4.132377 c 0.149666,0.109852 0.337706,0.175454 0.541192,0.175454 0.509451,0 0.922252,-0.412873 0.922252,-0.922323 0,-0.101743 -0.01616,-0.199764 -0.04712,-0.291185 L 20.935321,18.626298 26.62338,14.49471 c 0.231502,-0.170265 0.379629,-0.440831 0.379629,-0.746796 0,-0.09858 -0.01549,-0.194317 -0.04433,-0.283165 h -0.0028 c -0.123905,-0.373036 -0.469709,-0.63692 -0.87668,-0.63692 H 19.049381 L 16.877383,6.1430805 C 16.724031,5.8046758 16.389338,5.5738871 16.001536,5.5738882 Z m 10.957102,7.8909228 h 1.47e-4 l -0.0022,-0.0065 c 7.25e-4,0.0022 0.0013,0.0044 0.0021,0.0065 z m -10.957102,-4.0526684 1.50183,4.6241524 c 0.124599,0.372321 0.469593,0.636296 0.876562,0.636296 h 4.862988 l -3.934792,2.856061 c -0.2315,0.170308 -0.379629,0.441619 -0.379629,0.747584 0,0.101005 0.01618,0.199048 0.04641,0.290469 l -0.0022,-0.0065 1.503334,4.623365 -3.934076,-2.858352 c -0.149665,-0.109853 -0.337632,-0.175456 -0.54112,-0.175456 -0.203484,0 -0.391513,0.06561 -0.544127,0.177676 l 0.003,-0.0015 -3.934003,2.858425 1.502546,-4.623437 c 0.02875,-0.08553 0.04569,-0.183571 0.04569,-0.285313 0,-0.305228 -0.148928,-0.575764 -0.377481,-0.74386 l -0.003,-0.0015 -3.9333588,-2.857635 h 4.8622718 7.88e-4 c 0.406969,0 0.751977,-0.263952 0.873626,-0.629635 l 0.0022,-0.0065 z" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        <svg display="none">
            <symbol viewBox="0 0 32 32" id="svgstarthalf_0">
                <title>icon-star</title>
                <!--تم قلب الوجه باستخدام انكسكيب-->
                <path d="m 5.048448,13.452879 c 0.12386,-0.373056 0.469638,-0.636997 0.876608,-0.636997 h 7.029826 l 2.171984,-6.6847855 c 0.123861,-0.372319 0.468901,-0.63626 0.875871,-0.63626 0.101743,0 0.200536,0.016957 0.291957,0.047185 l -0.0066,-0.00221 c 0.277212,0.095845 0.489544,0.3148123 0.57433,0.5898123 l 0.0015,0.00664 0.01548,-0.00516 2.171984,6.6847852 h 7.02903 c 0.508713,0 0.921582,0.412869 0.921582,0.921582 0,0.305228 -0.148928,0.576541 -0.37748,0.743901 l -0.003,0.0015 -5.686528,4.130898 2.171984,6.685523 c 0.02875,0.08549 0.04497,0.183546 0.04497,0.285289 0,0.508713 -0.412869,0.921582 -0.921582,0.921582 -0.203485,0 -0.391488,-0.06562 -0.544102,-0.177681 l 0.0029,0.0015 -5.687265,-4.132373 -5.686528,4.132373 c -0.149665,0.109853 -0.337668,0.175469 -0.541153,0.175469 -0.50945,0 -0.922319,-0.412868 -0.922319,-0.922319 0,-0.101742 0.01622,-0.199799 0.04719,-0.29122 l -0.0022,0.0066 2.172721,-6.684048 L 5.38166,14.482829 C 5.15019,14.312531 5.002,14.041954 5.002,13.735989 c 0,-0.101005 0.01622,-0.199061 0.04645,-0.289745 l -0.0022,0.0066 z m 7.647654,4.063807 c 0.231501,0.170309 0.379692,0.441622 0.379692,0.747587 0,0.101006 -0.01622,0.199062 -0.04645,0.290483 l 0.0022,-0.0066 -1.503285,4.623391 3.934049,-2.858378 c 0.143029,-0.09953 0.32071,-0.158512 0.511662,-0.158512 0.01032,0 0.02064,0 0.03097,7.37e-4 h -0.0015 V 9.3993941 l -1.50181,4.6241289 c -0.124598,0.372319 -0.469638,0.63626 -0.876609,0.63626 H 8.762019 Z" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
            </symbol>
        </svg>
        
        
        
        
        
        
        
        
        
        
        
        
        
        
    </div>

</body>
</html>
